{
  "backend/main.mo": "Defines the backend actor with product, vendor, order, user profile types and maps, plus authorization and profile endpoints.",
  "feature_evidence.json": "Structured feature evidence report listing feature IDs, titles, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-like summary mapping frontend file paths to short descriptions of their UI behavior and styling.",
  "frontend/DEPLOYMENT.md": "Documents fixes for frontend production build issues involving environment variables, Vite setup, and TypeScript config.",
  "frontend/index.css": "Tailwind base theme and CSS variable definitions for light/dark color systems and global styles.",
  "frontend/index.html": "Base HTML document loading the Vite React app with manifest and mobile app meta tags.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, colors, and display mode.",
  "frontend/public/offline.html": "Standalone offline fallback page with gradient styling and retry button.",
  "frontend/public/sw.js": "Service worker implementing precaching, cache cleanup, and network-first or cache-first fetch strategies with offline fallback.",
  "frontend/src/App.tsx": "Sets up the main router with all public, customer, vendor, and admin routes wrapped in AppLayout and role-based access components.",
  "frontend/src/components/admin/AdminErrorBoundary.tsx": "React error boundary for admin pages that catches render errors and shows a fallback UI with refresh and home navigation.",
  "frontend/src/components/AppLayout.tsx": "Provides a page layout with top navigation, bottom navigation, and main content area.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access-denied UI with optional admin role assignment, access refresh logic, and detailed actor initialization errors.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that uses Internet Identity and handles auth flow, including clearing cache and retrying login on errors.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without a profile to enter basic details and save them via backend mutation.",
  "frontend/src/components/auth/RequireRole.tsx": "Role‑based access wrapper that validates user role, handles actor errors, logs denials, and shows loading or AccessDeniedScreen as needed.",
  "frontend/src/components/BottomNav.tsx": "Renders a mobile bottom navigation bar with role‑based links and cart badge.",
  "frontend/src/components/buttons/PrimaryCtaButton.tsx": "Wrapper around Button applying primary CTA gradient styling.",
  "frontend/src/components/DealCard.tsx": "Displays a product deal card with image, pricing, discount, and deal type badge linking to the product page.",
  "frontend/src/components/forms/FloatingLabelInput.tsx": "Input component with animated floating label styling using peer-based transitions.",
  "frontend/src/components/HeroBannerSlider.tsx": "Implements an auto‑rotating image banner slider with manual navigation controls.",
  "frontend/src/components/ProductGrid.tsx": "Renders a responsive product grid with images, pricing, stock badges, loading skeletons, and add‑to‑cart handling.",
  "frontend/src/components/status/OrderStatusBadge.tsx": "Badge displaying order status with dynamic class names and text based on status utilities.",
  "frontend/src/components/TopNav.tsx": "Provides the top navigation bar with search, role‑based actions, cart count, and mobile sheet menu.",
  "frontend/src/data/vendors.ts": "Static list of vendor metadata including id, shop name, location, and mobile number.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous actor, initializes access control, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useActorQueryState.ts": "Hook that passively reads actor query state from React Query cache to detect initialization status or errors without recreating the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status flags. Wraps AuthClient creation with custom options and exposes helper hooks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, products, and other backend data, integrating actor-based calls and Internet Identity when needed.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines a full light/dark OKLCH color system with utility classes for shadows and gradients.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission details and feature cards using styled UI components.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays admin analytics including totals and a bar chart overview using fetched analytics data.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all orders for admins with status controls and updates order status via mutation.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin page for listing, adding, editing, and deleting products with a product form dialog.",
  "frontend/src/pages/admin/AdminVendorsPage.tsx": "Allows admins to view, add, and remove vendors using dialogs and actor calls.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart, handles quantity updates, removals, and checkout routing, integrating product data and authentication.",
  "frontend/src/pages/CategoriesPage.tsx": "Shows a grid of product categories with loading skeletons and colorful icons linking to category detail pages.",
  "frontend/src/pages/CategoryListingPage.tsx": "Displays products filtered by category with sorting options and renders a product grid or an empty state.",
  "frontend/src/pages/CheckoutPage.tsx": "Builds an order summary from cart items, calculates totals, and submits an order before clearing the cart.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form with basic validation and simulated submission along with static contact info cards.",
  "frontend/src/pages/customer/CustomerProfilePage.tsx": "Shows the logged‑in customer's profile details, principal, and account role in a read‑only form.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Displays the customer's past orders with status badges and basic order info.",
  "frontend/src/pages/customer/WishlistPage.tsx": "Shows products saved to the customer’s wishlist with loading states, product cards, and availability info.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage with hero slider, login buttons, deal products, and feature highlights.",
  "frontend/src/pages/onboarding/CustomerLoginPage.tsx": "Customer login form collecting personal and location details with validation and navigation to vendor list.",
  "frontend/src/pages/onboarding/OutletDetailsPage.tsx": "Outlet details form for vendors with photo upload, validation, and saving data before navigating to the dashboard.",
  "frontend/src/pages/onboarding/SimpleVendorDashboardPage.tsx": "Displays vendor and outlet information after successful registration, including location, contact, and uploaded photo.",
  "frontend/src/pages/onboarding/VendorListPage.tsx": "Shows vendors filtered by city with navigation to individual vendor shop pages and handling for missing or empty results.",
  "frontend/src/pages/onboarding/VendorLoginPage.tsx": "Vendor login form collecting personal and location info with validation and navigation to outlet details.",
  "frontend/src/pages/onboarding/VendorShopPage.tsx": "Displays detailed information for a selected vendor shop with location and contact details, handling missing vendor cases.",
  "frontend/src/pages/ProductPage.tsx": "Loads and displays detailed product info including images, pricing, reviews, and allows adding to cart or submitting reviews.",
  "frontend/src/pages/vendor/VendorDashboardPage.tsx": "Vendor dashboard showing wallet dues, sales stats, outlet status, and a payment action using vendor data queries.",
  "frontend/src/pages/vendor/VendorOrdersPage.tsx": "Displays a vendor's orders with status badges, timestamps, and basic order details.",
  "frontend/src/pages/vendor/VendorProductsPage.tsx": "Product management page letting vendors add, edit, and delete products with a dialog form and category support.",
  "frontend/src/utils/categoryColors.ts": "Provides deterministic gradient background classes for categories based on a hash of the category ID.",
  "frontend/src/utils/categoryMatch.ts": "Utility to find a category by case‑insensitive name matching.",
  "frontend/src/utils/errors.ts": "Extracts readable error messages and formats them for diagnostics, handling traps and rejected calls.",
  "frontend/src/utils/formatInr.ts": "Formats numbers or bigints into INR currency strings with the ₹ prefix.",
  "frontend/src/utils/onboardingStorage.ts": "Stores and retrieves onboarding data for customers, vendors, and outlets in sessionStorage.",
  "frontend/src/utils/statusStyles.ts": "Maps order and UI statuses to classNames and provides stock availability styling helpers.",
  "frontend/src/utils/urlParams.ts": "Utilities to read, persist, and clear URL parameters with sessionStorage fallback, supporting hash routing.",
  "frontend/src/vite-env.d.ts": "Vite environment type declarations including optional II URL config.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom OKLCH color tokens, extended radii, shadows, animations, and includes typography, container-queries, and animate plugins.",
  "project_state.json": "Describes the project’s current architecture, features, generated assets, and known issues for an ICP-based marketplace app with RBAC and PWA support."
}