{
  "backend/main.mo": "Motoko canister defining product, order, vendor, and user profile types with maps for storage plus authorization and vendor checks.",
  "feature_evidence.json": "Feature evidence report mapping UI color and status‑related changes to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten textual summaries describing visual, styling, and functional behavior of key frontend components and pages.",
  "frontend/index.css": "Tailwind base theme defining OKLCH color variables for light/dark modes and applying global background, text, and border styles.",
  "frontend/index.html": "Simple HTML entry point loading the React bundle and root mount element.",
  "frontend/src/App.tsx": "Main routing setup using TanStack Router with role‑protected routes for customer, vendor, and admin sections.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper adding top/bottom navigation, background gradient, and the profile setup modal.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with options to return home or contact support.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication state and session clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter profile details and save them.",
  "frontend/src/components/auth/RequireRole.tsx": "Role-based access wrapper that blocks access unless the user has the required role.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar with dynamic active styling, icons, and a cart badge using cart query data.",
  "frontend/src/components/buttons/PrimaryCtaButton.tsx": "Styled button wrapper applying primary CTA gradient styling.",
  "frontend/src/components/HeroBannerSlider.tsx": "Auto-rotating image slider with navigation buttons and slide indicators.",
  "frontend/src/components/ProductGrid.tsx": "Renders a responsive product grid with images, pricing, wishlist and cart actions, and loading skeletons.",
  "frontend/src/components/status/OrderStatusBadge.tsx": "Badge displaying order status text with style classes derived from status.",
  "frontend/src/components/TopNav.tsx": "Top navigation bar with search, cart count, user actions, and responsive mobile menu.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login state, stored identities, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user, role, product, and other marketplace data through the actor API.",
  "frontend/src/index.css": "Configures global Tailwind CSS styles, color variables, themes, and custom utility classes for the frontend.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page showcasing the platform's mission and benefits with styled UI components.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing product, order, revenue, and vendor stats with a bar chart overview.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all orders for admins with status controls and details, allowing updates via mutation.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Provides product CRUD management for admins, including dialogs for adding, editing, and deleting products.",
  "frontend/src/pages/admin/AdminVendorsPage.tsx": "Lists vendors and allows admins to add or remove vendor entries through a form dialog.",
  "frontend/src/pages/CartPage.tsx": "Implements the shopping cart page with item listing, quantity updates, removal, and checkout handling tied to user identity.",
  "frontend/src/pages/CategoriesPage.tsx": "Displays a list of product categories with loading skeletons and links to category detail pages.",
  "frontend/src/pages/CategoryListingPage.tsx": "Displays products for a selected category with sorting and filtering, using ProductGrid for output.",
  "frontend/src/pages/CheckoutPage.tsx": "Builds an order summary from cart items and processes order creation with identity validation.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with basic validation and static contact details.",
  "frontend/src/pages/customer/CustomerProfilePage.tsx": "Shows and edits the logged‑in user's profile information, saving updates via mutation.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Displays the customer's past orders with basic details and status indicators.",
  "frontend/src/pages/customer/WishlistPage.tsx": "Shows products saved in the user's wishlist by filtering all products against wishlist IDs.",
  "frontend/src/pages/HomePage.tsx": "Shows hero banner, top categories, and sections for deals and featured products.",
  "frontend/src/pages/ProductPage.tsx": "Displays product details, image carousel, cart and wishlist actions, and review submission.",
  "frontend/src/pages/vendor/VendorDashboardPage.tsx": "Vendor overview showing product count, orders, revenue, and links to manage products and view orders.",
  "frontend/src/pages/vendor/VendorOrdersPage.tsx": "Vendor orders page that fetches and displays the vendor's orders with status, customer, items, date, and total.",
  "frontend/src/pages/vendor/VendorProductsPage.tsx": "Vendor product management page allowing listing, creating, editing, and deleting products via dialogs and API mutations.",
  "frontend/src/utils/statusStyles.ts": "Utility functions mapping order and UI statuses to class names and text labels, including stock availability helpers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Project metadata describing existing features, schema version, and high-level system capabilities."
}