{
  "backend/main.mo": "Defines the main canister with product, vendor, order, discount, cart, and user profile types, plus maps for storing them and authorization helpers using AccessControl and storage mixins.",
  "feature_evidence.json": "Lists implemented features with associated files, components, and test IDs for role-removal changes, AdminBypass, and admin dashboard rebuild.",
  "frontend-file-summaries.txt": "Collection of short summaries describing functionality and styling of various frontend components and pages.",
  "frontend/DEPLOYMENT.md": "Documents February 2026 production build fixes involving Vite env vars, missing configs, and added type declarations.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables for light and dark themes and applying global styles.",
  "frontend/index.html": "HTML entrypoint that sets metadata, manifest, app icons, and loads the React app via main.tsx.",
  "frontend/public/manifest.webmanifest": "PWA manifest declaring app name, colors, icons, categories, and display settings.",
  "frontend/public/offline.html": "Custom offline fallback page with gradient styling and retry button.",
  "frontend/public/sw.js": "Service worker implementing caching, offline fallback, and cache cleanup with network-first and cache-first strategies.",
  "frontend/src/App.tsx": "Sets up the app layout and full routing tree with customer, vendor, and admin protected routes.",
  "frontend/src/components/admin/AdminErrorBoundary.tsx": "React error boundary for admin pages that logs errors and shows a diagnostic fallback UI with copyable details.",
  "frontend/src/components/AppLayout.tsx": "Wraps pages with top and bottom navigation and a styled layout container.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access-denied UI with optional admin tools, diagnostic error info, and actions to refresh or assign admin roles.",
  "frontend/src/components/auth/AdminBypass.tsx": "Simple wrapper that only checks authentication and redirects unauthenticated users to customer login.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that triggers Internet Identity auth and handles clearing or reattempting sessions.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting newly authenticated users to create a basic profile and saving it through backend queries.",
  "frontend/src/components/auth/RequireRole.tsx": "Role-gated wrapper that enforces admin/vendor/customer access, showing loading states or denial screens based on actor and role state.",
  "frontend/src/components/auth/SafeAdminGate.tsx": "Empty file placeholder for an admin access component.",
  "frontend/src/components/BottomNav.tsx": "Renders a mobile bottom navigation bar that adapts links based on customer, vendor, or admin role.",
  "frontend/src/components/buttons/PrimaryCtaButton.tsx": "Wrapper around Button that applies a primary gradient style to call‑to‑action buttons.",
  "frontend/src/components/DealCard.tsx": "Displays a product deal card with image, pricing, discount, and optional offer tag.",
  "frontend/src/components/forms/FloatingLabelInput.tsx": "Input field with floating label behavior using shadcn UI components.",
  "frontend/src/components/HeroBannerSlider.tsx": "Implements an auto‑rotating hero banner slider with navigation controls and indicators.",
  "frontend/src/components/ProductGrid.tsx": "Shows a grid of product cards with pricing, discounts, stock status, and add‑to‑cart support.",
  "frontend/src/components/status/OrderStatusBadge.tsx": "Badge that displays order status text styled using shared status utility functions.",
  "frontend/src/components/TopNav.tsx": "Provides the top navigation bar with search, role‑aware actions, cart info, and responsive layout.",
  "frontend/src/data/vendors.ts": "Static vendor dataset with basic shop details for demo or lookup use.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity, reinitializing and invalidating queries on identity changes.",
  "frontend/src/hooks/useActorQueryState.ts": "Provides a lightweight hook to read and subscribe to actor query cache state without re-creating the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider with login, logout, identity loading, and status management using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user roles, profiles, and various backend interactions using an actor instance.",
  "frontend/src/index.css": "Configures Tailwind base styles and custom theme variables for light and dark modes with utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page highlighting QuickBazar’s mission and features with styled cards and icons.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays vendor list with outlet status controls and loading states, allowing admins to toggle vendor outlet status.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Shows all orders with details and lets admins update order statuses.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Provides product CRUD operations with a form dialog for creating and editing products.",
  "frontend/src/pages/admin/AdminVendorsPage.tsx": "Allows admins to add and remove vendors via a dialog form and vendor list view.",
  "frontend/src/pages/CartPage.tsx": "Displays and manages the user’s shopping cart, including quantity updates, item removal, subtotal calculation, and checkout navigation.",
  "frontend/src/pages/CategoriesPage.tsx": "Displays all categories with loading skeletons, fetching category data and rendering colored cards linking to each category.",
  "frontend/src/pages/CategoryListingPage.tsx": "Shows products for a specific category with sorting options and handles empty states using fetched product and category data.",
  "frontend/src/pages/CheckoutPage.tsx": "Builds an order summary from cart data and processes order creation, clearing the cart and navigating on success.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form with validation and simulated submission plus cards showing contact methods.",
  "frontend/src/pages/customer/CustomerProfilePage.tsx": "Displays the logged‑in customer's profile and role information in read‑only fields.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Shows the customer's order history with basic details and status badges.",
  "frontend/src/pages/customer/WishlistPage.tsx": "Displays the customer's wishlist by fetching wishlist IDs and product data, showing loading skeletons, empty state, or product cards with discounts and stock badges.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero slider, login buttons, featured deals, and feature cards using product data.",
  "frontend/src/pages/onboarding/CustomerLoginPage.tsx": "Provides a customer login form with validation and stores the entered data before navigating to the vendor list filtered by city.",
  "frontend/src/pages/onboarding/OutletDetailsPage.tsx": "Collects outlet details, including an image upload with preview and validation, then saves the data and navigates to the vendor dashboard.",
  "frontend/src/pages/onboarding/SimpleVendorDashboardPage.tsx": "Shows a simple vendor dashboard summarizing outlet info, vendor data, and a registration success message.",
  "frontend/src/pages/onboarding/VendorListPage.tsx": "Lists vendors filtered by city from search params, showing empty states or vendor cards with navigation to individual shops.",
  "frontend/src/pages/onboarding/VendorLoginPage.tsx": "Renders a vendor login form with validation and saves the data before navigating to the outlet details step.",
  "frontend/src/pages/onboarding/VendorShopPage.tsx": "Displays vendor details by vendorId, showing location and contact info with a fallback error state if the vendor is not found.",
  "frontend/src/pages/ProductPage.tsx": "Displays product details, image carousel, pricing, reviews, and allows adding to cart and submitting reviews.",
  "frontend/src/pages/vendor/VendorDashboardPage.tsx": "Shows vendor dashboard stats, orders, and wallet dues, with payment handling and outlet status alerts.",
  "frontend/src/pages/vendor/VendorOrdersPage.tsx": "Lists vendor orders with status, date, customer info, and totals, with a loading and empty state.",
  "frontend/src/pages/vendor/VendorProductsPage.tsx": "Allows vendors to view, add, edit, and delete products using dialog-based forms tied to backend mutations.",
  "frontend/src/utils/categoryColors.ts": "Provides deterministic category-to-color mapping using a hash-based palette index.",
  "frontend/src/utils/categoryMatch.ts": "Finds a category by case-insensitive name matching.",
  "frontend/src/utils/errors.ts": "Extracts readable error messages, formats them for diagnostics, and builds detailed diagnostics text blocks.",
  "frontend/src/utils/formatInr.ts": "Formats numbers or bigints into INR currency strings with safety guards for invalid inputs.",
  "frontend/src/utils/onboardingStorage.ts": "Handles saving, retrieving, and clearing onboarding-related sessionStorage data for customers, vendors, and outlets.",
  "frontend/src/utils/safeNumbers.ts": "Provides safe conversions and formatting for bigint and number values to prevent rendering errors.",
  "frontend/src/utils/statusStyles.ts": "Provides helper functions to map order/UI/stock statuses to display text and Tailwind class names.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing params.",
  "frontend/src/vite-env.d.ts": "Type definitions for Vite environment variables used in the frontend.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, radius, shadows, and animations, and enabling plugins.",
  "project_state.json": "Project state metadata describing the admin dashboard rebuild, required features, and known issues."
}