{
  "backend/main.mo": "Motoko actor defining e‑commerce types, storage maps, vendor tracking, and authorization helpers including profile retrieval and permission checks.",
  "feature_evidence.json": "Feature evidence report listing branding, logo, and PWA asset update requirements with associated files and components.",
  "frontend-file-summaries.txt": "JSON-like mapping of frontend file paths to short descriptions of their UI and styling behavior.",
  "frontend/index.css": "Tailwind CSS root variables and theme definitions for light/dark modes with OKLCH color tokens.",
  "frontend/index.html": "Main HTML entry with QuickBazar branding, manifest links, meta tags, and root mounting point.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining QuickBazar name, icons, colors, categories, and launch configuration.",
  "frontend/public/offline.html": "Standalone offline fallback page with gradient branding and retry link.",
  "frontend/public/sw.js": "Service worker implementing precaching, cache cleanup, and network-first or cache-first strategies with offline fallback.",
  "frontend/src/App.tsx": "Configures the main TanStack router with routes for public pages, customer, vendor, and admin sections, wrapping everything in AppLayout.",
  "frontend/src/components/AppLayout.tsx": "Provides the global page layout with top and bottom navigation and a styled main content area.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access‑denied message with guidance and links to home or support.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity and clears queries on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal for authenticated users without a profile to submit name and contact info.",
  "frontend/src/components/auth/RequireRole.tsx": "Guards child components based on required user roles and displays access-denied states when unauthorized.",
  "frontend/src/components/BottomNav.tsx": "Renders a mobile bottom navigation bar that adapts links based on user role and shows cart count badges.",
  "frontend/src/components/buttons/PrimaryCtaButton.tsx": "Wraps the base Button with a primary gradient CTA style.",
  "frontend/src/components/DealCard.tsx": "Displays a product deal card with image, pricing, discount info, and an optional ribbon, linking to the product page.",
  "frontend/src/components/forms/FloatingLabelInput.tsx": "Implements an input with floating label behavior using Tailwind classes.",
  "frontend/src/components/HeroBannerSlider.tsx": "Implements an auto-rotating banner slider with manual navigation buttons and slide indicators.",
  "frontend/src/components/ProductGrid.tsx": "Renders a responsive product grid with loading skeletons, pricing, discounts, stock badges, and add-to-cart support.",
  "frontend/src/components/status/OrderStatusBadge.tsx": "Displays an order status badge styled via helper functions.",
  "frontend/src/components/TopNav.tsx": "Implements the top navigation bar with search, logo, role‑based actions, cart badge, and mobile sheet menu.",
  "frontend/src/data/vendors.ts": "Exports a static list of sample vendor entries with basic shop details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, exposing identity, login, logout, and login state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, roles, vendors, products, and other backend-driven data operations.",
  "frontend/src/index.css": "Defines Tailwind base layers plus custom color variables, themes, shadows, and utility styles.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission details and feature cards explaining platform benefits. Mostly static UI with icons and styled sections.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Shows admin analytics including product, order, vendor counts, revenue, and a bar chart overview.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Lists all orders with status, customer info, totals, and allows admins to update order status.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Provides product management for admins including listing, adding, editing, and deleting products with a form dialog.",
  "frontend/src/pages/admin/AdminVendorsPage.tsx": "Provides an admin interface to list, add, and remove vendors, including a dialog form for creating new vendor entries.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart, handles quantity updates, item removal, and navigation to checkout. Computes pricing with discounts and manages signed-in state.",
  "frontend/src/pages/CategoriesPage.tsx": "Fetches and lists all categories with images and color accents, showing skeletons while loading. Each category links to its dedicated listing page.",
  "frontend/src/pages/CategoryListingPage.tsx": "Shows products filtered by a category and supports sorting by name, price, or discount. Uses memoized filtering and displays a product grid.",
  "frontend/src/pages/CheckoutPage.tsx": "Builds an order summary from the cart, calculates totals, and submits a new order while clearing the cart. Requires sign-in and handles processing state and errors.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form with validation and mock submission along with contact info cards. Manages form state and shows toast notifications.",
  "frontend/src/pages/customer/CustomerProfilePage.tsx": "Displays the logged‑in customer's profile and role, showing principal ID and stored personal details in read‑only form.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Fetches and displays the customer's orders with status, totals, and timestamps, showing an empty state if none exist.",
  "frontend/src/pages/customer/WishlistPage.tsx": "Shows the user's wishlist by matching stored product IDs with product data, rendering product cards or loading/empty states.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with hero slider, login buttons, featured deals from the first four products, and a features section.",
  "frontend/src/pages/onboarding/CustomerLoginPage.tsx": "Implements a customer login/onboarding form with validation and saves the data before navigating to the vendor list.",
  "frontend/src/pages/onboarding/OutletDetailsPage.tsx": "Collects outlet details and photo for vendor onboarding with validation, saving the data and navigating to the vendor dashboard.",
  "frontend/src/pages/onboarding/SimpleVendorDashboardPage.tsx": "Shows a vendor dashboard with registration confirmation and detailed outlet info using stored onboarding data, redirecting to login if missing.",
  "frontend/src/pages/onboarding/VendorListPage.tsx": "Displays vendors filtered by city with navigation to vendor shops, or empty states when no city or vendors are found.",
  "frontend/src/pages/onboarding/VendorLoginPage.tsx": "Implements a vendor login form with validation, saving data to onboarding storage and navigating to outlet details on success.",
  "frontend/src/pages/onboarding/VendorShopPage.tsx": "Shows detailed info for a selected vendor shop using vendorId, with back navigation and a not-found state.",
  "frontend/src/pages/ProductPage.tsx": "Displays detailed product information with image carousel, pricing, reviews, and allows adding to cart and submitting reviews.",
  "frontend/src/pages/vendor/VendorDashboardPage.tsx": "Renders the main vendor dashboard with stats, products, orders, wallet due, and payment handling for re-enabling disabled outlets.",
  "frontend/src/pages/vendor/VendorOrdersPage.tsx": "Lists vendor orders with status, timestamps, and basic order info, showing loading and empty states as needed.",
  "frontend/src/pages/vendor/VendorProductsPage.tsx": "Vendor UI for listing, adding, editing and deleting products with dialog-based form and query hooks.",
  "frontend/src/utils/categoryColors.ts": "Deterministically maps category IDs to gradient color classes using a hash.",
  "frontend/src/utils/categoryMatch.ts": "Provides case-insensitive lookup of a category by name.",
  "frontend/src/utils/formatInr.ts": "Formats bigint or number values into INR currency strings.",
  "frontend/src/utils/onboardingStorage.ts": "Handles saving, retrieving and clearing onboarding data in sessionStorage for customers, vendors and outlets.",
  "frontend/src/utils/statusStyles.ts": "Maps order/UI statuses and stock levels to human‑readable text and Tailwind class names.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting and clearing URL parameters using query strings, hash routing and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, radius, shadows, animations and plugin setup.",
  "project_state.json": "Describes the project's current state, features and versions for the marketplace app."
}