{
  "backend/main.mo": "Motoko canister defining types and state for products, vendors, orders, users, and authorization, with helpers for admin/vendor checks and profile management.",
  "feature_evidence.json": "Feature evidence report listing restored frontend build configs, Vite env shims, deployment verification steps, and associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each major frontend page and component, focused on admin, vendor, customer flows, UI styling, and feature behavior.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining production build fixes, added Vite/TypeScript configs, process.env shim, required env vars, and build/deploy steps.",
  "frontend/index.css": "Tailwind CSS base layer defining OKLCH color variables, dark mode overrides, and global background/text styling.",
  "frontend/index.html": "Base HTML template loading the React app root with PWA metadata and manifest links.",
  "frontend/public/manifest.webmanifest": "PWA manifest configuring app name, theme colors, start URL, display mode, and icons.",
  "frontend/public/offline.html": "Standalone offline fallback page with gradient styling and a retry button.",
  "frontend/public/sw.js": "Service worker that precaches assets, cleans old caches, and handles fetch with network-first for HTML and cache-first for static assets.",
  "frontend/src/App.tsx": "Defines the main React app routes using TanStack Router, including customer, vendor, and admin pages with role-based protection.",
  "frontend/src/components/admin/AdminErrorBoundary.tsx": "Error boundary for admin pages that logs diagnostics and shows a fallback UI when crashes occur.",
  "frontend/src/components/admin/AdminNav.tsx": "Admin navigation tabs linking to control panel, vendors, orders, and products.",
  "frontend/src/components/AppLayout.tsx": "App layout wrapper providing top navigation, bottom navigation, and main content area with gradient background.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with optional admin tools and backend error diagnostics.",
  "frontend/src/components/auth/AdminBypass.tsx": "Wrapper that requires authentication for admin routes and redirects unauthenticated users to login.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with automatic session clearing and retry handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter profile details and save them to the backend.",
  "frontend/src/components/auth/RequireRole.tsx": "Role‑based access gate that enforces admin, vendor, or customer permissions with detailed admin state handling.",
  "frontend/src/components/auth/SafeAdminGate.tsx": "Empty placeholder file intended for an admin access guard component.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar that switches links based on user role and displays cart badges and active states.",
  "frontend/src/components/buttons/PrimaryCtaButton.tsx": "Styled button component applying a primary gradient CTA appearance.",
  "frontend/src/components/DealCard.tsx": "Displays a product deal card with image, pricing, discount, and optional deal ribbon linking to the product page.",
  "frontend/src/components/forms/FloatingLabelInput.tsx": "React floating label input wrapper using custom Input and Label with peer-based animations.",
  "frontend/src/components/HeroBannerSlider.tsx": "Auto-rotating hero banner slider with manual navigation arrows and slide indicators.",
  "frontend/src/components/ProductGrid.tsx": "Renders a responsive product grid with loading skeletons, pricing, stock badges, and add-to-cart support.",
  "frontend/src/components/status/OrderStatusBadge.tsx": "Renders a Badge styled based on order status using helper functions.",
  "frontend/src/components/TopNav.tsx": "Top navigation bar with search, logo, cart count, role-based actions, and responsive layout.",
  "frontend/src/data/vendors.ts": "Defines VendorData interface and a static list of sample vendor entries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor via React Query, updating on identity changes.",
  "frontend/src/hooks/useActorQueryState.ts": "Reads actor query state from React Query cache using a lightweight external store subscription.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, roles, and related backend data.",
  "frontend/src/index.css": "Tailwind setup with a detailed light/dark color system and custom utility classes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "About page component showcasing mission, features, and service highlights with styled cards.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing navigation cards for vendor management and orders, plus quick action buttons.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin interface for viewing and filtering orders by city and updating order statuses.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin page to list, create, edit, and delete products with a dialog-based product form.",
  "frontend/src/pages/admin/AdminVendorsPage.tsx": "Admin vendor management page enabling approval, rejection, outlet status toggling, payments, and document viewing.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart, calculates subtotal, handles authentication checks, and navigates to checkout.",
  "frontend/src/pages/CategoriesPage.tsx": "Fetches and lists all product categories with loading skeletons and links to category pages.",
  "frontend/src/pages/CategoryListingPage.tsx": "Shows products within a selected category with sorting options and handles empty results.",
  "frontend/src/pages/CheckoutPage.tsx": "Builds an order summary from cart items, validates identity, creates an order, and clears the cart.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form with validation and static contact info cards.",
  "frontend/src/pages/customer/CustomerProfilePage.tsx": "Displays the logged‑in customer's profile details and role with read‑only fields.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Displays a customer's order list using fetched data, showing order status, date, item count, and total price with loading and empty states.",
  "frontend/src/pages/customer/WishlistPage.tsx": "Shows the user's wishlist by matching stored product IDs with fetched products, rendering product cards with images, pricing, discounts, and availability indicators.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero banners, login buttons, featured deals, and feature highlights.",
  "frontend/src/pages/onboarding/CustomerLoginPage.tsx": "Provides a customer login form with validation for personal details and redirects to the vendor list on successful submission.",
  "frontend/src/pages/onboarding/OutletDetailsPage.tsx": "Collects and validates vendor outlet details including photo upload, then saves data and redirects to the vendor dashboard.",
  "frontend/src/pages/onboarding/SimpleVendorDashboardPage.tsx": "Displays a simple vendor dashboard summarizing registration success and showing stored outlet and personal information.",
  "frontend/src/pages/onboarding/VendorListPage.tsx": "Lists vendors filtered by city from search params, with cards showing vendor details and navigation to individual shop pages.",
  "frontend/src/pages/onboarding/VendorLoginPage.tsx": "A vendor login form that validates inputs, saves data, and navigates to outlet details on success.",
  "frontend/src/pages/onboarding/VendorShopPage.tsx": "Displays vendor details by ID with location and contact info, or shows a not-found state.",
  "frontend/src/pages/ProductPage.tsx": "Displays product details with image carousel, pricing, availability, reviews, and allows adding to cart and submitting reviews.",
  "frontend/src/pages/vendor/VendorDashboardPage.tsx": "Shows vendor wallet due, sales, outlet info, and uses queries to load vendor-related data.",
  "frontend/src/pages/vendor/VendorOrdersPage.tsx": "Lists vendor orders with status, dates, and details, with loading and empty states.",
  "frontend/src/pages/vendor/VendorProductsPage.tsx": "Manages vendor products including add, edit, delete, and displays product list with dialogs.",
  "frontend/src/utils/categoryColors.ts": "Provides deterministic color classes for categories based on hashed IDs.",
  "frontend/src/utils/categoryMatch.ts": "Finds a category by case-insensitive name match from a list.",
  "frontend/src/utils/errors.ts": "Utilities to extract, format, and generate diagnostics text for error messages.",
  "frontend/src/utils/formatInr.ts": "Formats numeric or bigint amounts into INR currency strings.",
  "frontend/src/utils/onboardingStorage.ts": "Handles saving, retrieving, and clearing onboarding-related sessionStorage data for customers, vendors, and outlets.",
  "frontend/src/utils/safeNumbers.ts": "Provides safe numeric conversion, formatting, and sanitization utilities to prevent invalid numeric outputs.",
  "frontend/src/utils/statusStyles.ts": "Maps order, UI, and stock statuses to corresponding text labels and CSS class names for consistent styling.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/vite-env.d.ts": "Declares Vite environment types and exposes optional VITE_II_URL to TypeScript.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration with custom colors, animations, breakpoints, and plugins.",
  "frontend/tsconfig.node.json": "TypeScript config for Node‑based tooling, enabling ESNext modules and strict settings.",
  "frontend/vite.config.ts": "Configures Vite with React, path aliases, env shims, optimized build outputs, and dev server settings.",
  "project_state.json": "Stores project metadata including features, requirements, and current project state info."
}