{
  "backend/main.mo": "Motoko canister defining marketplace data types, persistent maps, and APIs for products, users, vendors, carts, orders, and authorization.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-style mapping of many frontend files to short descriptive summaries used for build planning.",
  "frontend/DEPLOYMENT.md": "Notes describing fixes for frontend production build issues related to Vite env vars, missing config files, and added TypeScript declarations.",
  "frontend/index.css": "Tailwind base/theme variable definitions configuring OKLCH color tokens and dark mode for the entire frontend.",
  "frontend/index.html": "Base HTML entry file loading the React app and setting PWA meta tags and manifest links.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, icons, and category settings.",
  "frontend/public/offline.html": "Standalone offline fallback page with gradient styling and retry button shown when network requests fail.",
  "frontend/public/sw.js": "Service worker implementing cache management, offline fallback handling, and selective caching for static assets.",
  "frontend/src/App.tsx": "Sets up the root layout and defines all customer, vendor, and admin routes with role-based protection using TanStack Router.",
  "frontend/src/components/admin/AdminErrorBoundary.tsx": "React error boundary for admin pages that logs diagnostics and shows a styled fallback UI with copyable debug info.",
  "frontend/src/components/AppLayout.tsx": "Wraps pages with top and bottom navigation and a styled main container.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied UI with diagnostic details and options to refresh access or assign admin role.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that manages Internet Identity authentication and clears query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to submit basic profile information and save it via hooks.",
  "frontend/src/components/auth/RequireRole.tsx": "Role‑based access wrapper that checks user/admin/vendor roles and renders loading or denial screens accordingly.",
  "frontend/src/components/BottomNav.tsx": "Renders a mobile bottom navigation bar that adapts links based on user role and shows cart badge counts.",
  "frontend/src/components/buttons/PrimaryCtaButton.tsx": "Styled wrapper around the Button component applying primary CTA gradient styles.",
  "frontend/src/components/DealCard.tsx": "Displays a product card with image, pricing, discount, and an optional deal tag linking to the product page.",
  "frontend/src/components/forms/FloatingLabelInput.tsx": "Input component with floating label styling using peer-focus behavior.",
  "frontend/src/components/HeroBannerSlider.tsx": "Implements an auto-rotating banner slider with manual navigation controls.",
  "frontend/src/components/ProductGrid.tsx": "Shows a grid of product cards with pricing, availability, loading skeletons, and add‑to‑cart support.",
  "frontend/src/components/status/OrderStatusBadge.tsx": "Badge displaying order status using helper functions to map style and label.",
  "frontend/src/components/TopNav.tsx": "Provides the top navigation bar with search, role-aware actions, cart badge, and mobile menu.",
  "frontend/src/data/vendors.ts": "Static list of sample vendor data including IDs, shop details, and contact numbers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor, reinitializing on identity changes and injecting admin tokens when present.",
  "frontend/src/hooks/useActorQueryState.ts": "Lightweight hook that reads and subscribes to the actor query state from the React Query cache.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity state handling. Wraps children with an auth provider using DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and mutating user profiles, roles, products, and other backend data using an actor and Internet Identity.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and custom color variables for light and dark themes, along with utility styles and shadows.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders a styled About page describing the marketplace mission and features with icon-based highlight cards.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays admin analytics with loading, error, and empty states plus charts and metric cards.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all orders for admins with status controls and updates via mutation hooks.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin interface for listing, adding, editing, and deleting products using dialog forms and query hooks.",
  "frontend/src/pages/admin/AdminVendorsPage.tsx": "Manages vendor accounts, allowing admins to add or remove vendors through dialogs and actor calls.",
  "frontend/src/pages/CartPage.tsx": "Implements the shopping cart page, handling quantity updates, removals, checkout navigation, and identity‑based access.",
  "frontend/src/pages/CategoriesPage.tsx": "Displays product categories with loading skeletons, styled cards, and links to individual category pages.",
  "frontend/src/pages/CategoryListingPage.tsx": "Displays products for a selected category with sorting and filtering options using product and category queries.",
  "frontend/src/pages/CheckoutPage.tsx": "Builds an order summary from cart items and submits an order after validating identity and cart contents.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form with basic validation and simulated submission plus static contact info cards.",
  "frontend/src/pages/customer/CustomerProfilePage.tsx": "Shows the logged‑in customer’s profile and identity details in read‑only form.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Lists a customer’s orders with basic order info and status badges.",
  "frontend/src/pages/customer/WishlistPage.tsx": "Displays wishlist products with loading states, images, discounts, and stock badges.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with hero slider, login buttons, featured deals, and feature highlights.",
  "frontend/src/pages/onboarding/CustomerLoginPage.tsx": "Customer login form collecting personal and location details with validation and navigation to vendor list.",
  "frontend/src/pages/onboarding/OutletDetailsPage.tsx": "Vendor outlet details form with image upload, validation, and saving before navigating to dashboard.",
  "frontend/src/pages/onboarding/SimpleVendorDashboardPage.tsx": "Displays vendor and outlet info after registration, showing location, contacts, and uploaded photo.",
  "frontend/src/pages/onboarding/VendorListPage.tsx": "Shows vendors filtered by selected city with navigation to individual vendor shop pages.",
  "frontend/src/pages/onboarding/VendorLoginPage.tsx": "Vendor login form collecting personal and location data with validation and redirect to outlet details.",
  "frontend/src/pages/onboarding/VendorShopPage.tsx": "Displays details for a specific vendor including location and contact, with fallback if vendor not found.",
  "frontend/src/pages/ProductPage.tsx": "Shows detailed product info, image carousel, pricing, reviews, and supports adding to cart and submitting reviews.",
  "frontend/src/pages/vendor/VendorDashboardPage.tsx": "Vendor dashboard showing stats, products, orders, wallet dues, and outlet status with ability to pay the company.",
  "frontend/src/pages/vendor/VendorOrdersPage.tsx": "Displays vendor orders with status, timestamps, and details, handling loading and empty states.",
  "frontend/src/pages/vendor/VendorProductsPage.tsx": "Manages vendor products, including adding, editing, and deleting items via dialogs and API mutations.",
  "frontend/src/utils/categoryColors.ts": "Provides deterministic gradient colors for categories based on hashed category IDs.",
  "frontend/src/utils/categoryMatch.ts": "Finds a category by case‑insensitive name matching.",
  "frontend/src/utils/errors.ts": "Utilities to extract, format, and generate diagnostics text for user‑friendly error messages.",
  "frontend/src/utils/formatInr.ts": "Formats numbers or bigints into INR currency strings safely.",
  "frontend/src/utils/onboardingStorage.ts": "Handles saving, retrieving, and clearing customer, vendor, and outlet onboarding data in sessionStorage.",
  "frontend/src/utils/safeNumbers.ts": "Safe conversion and formatting helpers for numbers and bigints, preventing crashes from invalid values.",
  "frontend/src/utils/statusStyles.ts": "Maps order and UI statuses to class names and labels, including stock availability styling.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, and clear URL and sessionStorage parameters with support for hash-based routing.",
  "frontend/src/vite-env.d.ts": "Declares Vite environment type definitions, including an optional VITE_II_URL env variable.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Stores project metadata, known issues, and feature requests related to fixing an admin dashboard crash."
}