{
  "backend/main.mo": "Defines the backend actor with product, order, vendor, and user types plus maps for storing marketplace data and authorization mixins.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend pages and components.",
  "frontend/DEPLOYMENT.md": "Documentation describing frontend build fixes, TypeScript config setup, and Vite environment shims.",
  "frontend/index.css": "Tailwind base theme and CSS variables for light and dark mode color systems.",
  "frontend/index.html": "Main HTML entry point loading the React app and PWA metadata.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme, and display settings.",
  "frontend/public/offline.html": "Custom offline fallback page with styled UI and retry button.",
  "frontend/public/sw.js": "Service worker handling caching, offline support, and app shell strategy.",
  "frontend/src/App.tsx": "Sets up the root layout and defines all application routes, including customer, vendor, admin, and onboarding paths with role protection.",
  "frontend/src/components/admin/AdminErrorBoundary.tsx": "React error boundary for admin pages that logs crashes and shows a diagnostics UI with copy-to-clipboard support.",
  "frontend/src/components/admin/AdminNav.tsx": "Navigation bar for admin routes using tab-style links with icons.",
  "frontend/src/components/admin/VendorDocumentsDialog.tsx": "Dialog that loads and displays vendor-uploaded documents with view and download actions.",
  "frontend/src/components/AppLayout.tsx": "Wraps pages with navigation and layout styling, and auto-redirects vendors after login.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Access denial UI that can show backend initialization errors and trigger access refresh or admin role assignment.",
  "frontend/src/components/auth/AdminBypass.tsx": "Wrapper that allows only authenticated users to access admin routes, redirecting unauthenticated users to login.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with automatic session clearing and retry logic.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to create their profile with basic personal information.",
  "frontend/src/components/auth/RequireRole.tsx": "Role-based access gate that verifies admin/vendor/customer roles and handles loading and error states.",
  "frontend/src/components/auth/SafeAdminGate.tsx": "Empty file.",
  "frontend/src/components/BottomNav.tsx": "Renders a mobile bottom navigation bar that switches items based on user role and shows cart counts.",
  "frontend/src/components/buttons/PrimaryCtaButton.tsx": "Styled primary call-to-action button wrapper around the base UI Button.",
  "frontend/src/components/DealCard.tsx": "Displays a styled product deal card with pricing, discount, image, and navigation to the product page.",
  "frontend/src/components/forms/FloatingLabelInput.tsx": "Floating input component that pairs a styled Input with a floating Label using peer-focus transitions.",
  "frontend/src/components/HeroBannerSlider.tsx": "Implements an auto-rotating, swipeable banner slider linking to store categories.",
  "frontend/src/components/ProductGrid.tsx": "Renders a grid of product cards with pricing, stock indicators, images, and add-to-cart support.",
  "frontend/src/components/pwa/A2HSInstallBanner.tsx": "Displays an install banner for the PWA when installable, providing install and dismiss actions.",
  "frontend/src/components/status/OrderStatusBadge.tsx": "Renders a badge with styling and text based on order status helpers.",
  "frontend/src/components/TopNav.tsx": "Displays the top navigation bar with logo, search, role‑aware actions, and cart status.",
  "frontend/src/components/vendor/EditOutletDialog.tsx": "Dialog form for editing a vendor’s outlet details, including photo upload and profile update mutation.",
  "frontend/src/components/vendor/VendorTabs.tsx": "Navigation tabs for vendor pages with active-state styling and icons.",
  "frontend/src/constants/storeCategories.ts": "Defines store category constants and helper functions for labels, parsing, and slugs.",
  "frontend/src/data/vendors.ts": "Provides sample vendor data with basic shop details for testing or display.",
  "frontend/src/hooks/useA2HS.ts": "Custom hook managing Add-to-Home-Screen installability, prompting, and install state.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useActorQueryState.ts": "Lightweight hook to read actor query state from React Query cache via external store subscription.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider implementing Internet Identity auth lifecycle with login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, roles, admin/vendor checks, and profile mutations tied to the Internet Identity actor.",
  "frontend/src/index.css": "Configures Tailwind layers and custom CSS variables for light/dark themes plus marketplace UI utilities like card shadows and transitions.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, and feature sections using styled cards and icons.",
  "frontend/src/pages/admin/AdminAnalyticsPage.tsx": "Admin dashboard page displaying vendor, order, sales, and commission analytics using fetched admin data.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with navigation cards for vendor management, orders, and quick actions.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays and filters orders by city, shows order details, and allows updating order status.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Provides a CRUD interface for products, including add, edit, delete, and category selection.",
  "frontend/src/pages/admin/AdminVendorsPage.tsx": "Manages vendors with approval, rejection, outlet status toggling, payment marking, and document viewing.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart, merges products with cart items, calculates totals, and handles checkout and empty states.",
  "frontend/src/pages/CategoriesPage.tsx": "Shows a list of store categories with icons and gradients, linking to category-specific pages.",
  "frontend/src/pages/CategoryListingPage.tsx": "Filters and sorts products within a selected category and renders them in a product grid.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that displays cart items, calculates totals, and creates an order before clearing the cart and navigating to orders.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page allowing users to submit name, email, and message with simulated async submission and contact info cards.",
  "frontend/src/pages/customer/CustomerProfilePage.tsx": "Shows the logged‑in customer's profile and role with read‑only personal details.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Lists customer orders with status badges, totals, and order metadata.",
  "frontend/src/pages/customer/WishlistPage.tsx": "Displays the user's wishlist by combining wishlist IDs with product data and shows loading skeletons, empty state, and product cards with discounts and stock badges.",
  "frontend/src/pages/HomePage.tsx": "Home page showing hero slider, login buttons, product deals, and category cards linking to store categories.",
  "frontend/src/pages/onboarding/CustomerLoginPage.tsx": "Provides a customer login form with validation and saves login data before navigating to the vendor list filtered by city.",
  "frontend/src/pages/onboarding/OutletDetailsPage.tsx": "Collects outlet details including photo upload and validates inputs before saving data and navigating to the vendor dashboard.",
  "frontend/src/pages/onboarding/SimpleVendorDashboardPage.tsx": "Shows a vendor dashboard with registration success info and displays vendor and outlet details saved during onboarding.",
  "frontend/src/pages/onboarding/VendorListPage.tsx": "Lists vendors filtered by selected city, with navigation to individual vendor shops and empty states when no city or vendors are available.",
  "frontend/src/pages/onboarding/VendorLoginPage.tsx": "Provides a vendor login form with validation and stores vendor data before moving to outlet details entry.",
  "frontend/src/pages/onboarding/VendorShopPage.tsx": "Displays a vendor’s shop details from static data and handles missing-vendor fallback navigation.",
  "frontend/src/pages/ProductPage.tsx": "Product details page with image carousel, price calculation, add-to-cart handling, and review submission.",
  "frontend/src/pages/store/StoreCategoryVendorsPage.tsx": "Shows vendors by store category with loading, error, and empty states, redirecting on invalid categories.",
  "frontend/src/pages/store/VendorShopPage.tsx": "Displays a vendor’s store profile and lets owners manage products, including add, edit, delete, and image handling.",
  "frontend/src/pages/vendor/VendorDashboardPage.tsx": "Vendor dashboard showing product counts, orders, wallet status warnings, and outlet status alerts.",
  "frontend/src/pages/vendor/VendorOrdersPage.tsx": "Lists vendor orders with status, dates, and totals, including a loading and empty state.",
  "frontend/src/pages/vendor/VendorProductsPage.tsx": "Allows vendors to view, create, edit, and delete their products using a form and modal dialog.",
  "frontend/src/pages/vendor/VendorProfilePage.tsx": "Renders the vendor profile UI showing vendor info, verification, outlet details, and loading states using various UI components.",
  "frontend/src/pages/vendor/VendorWalletPage.tsx": "Displays vendor wallet balance, outlet status alerts, and sales/commission summaries with loading and limit warnings.",
  "frontend/src/utils/categoryColors.ts": "Provides a deterministic hash‑based mapping from category IDs to preset gradient color classes.",
  "frontend/src/utils/categoryMatch.ts": "Offers a case‑insensitive lookup to find a category by name from a list.",
  "frontend/src/utils/errors.ts": "Extracts readable error messages, formats diagnostics text, and sanitizes long error outputs.",
  "frontend/src/utils/formatInr.ts": "Formats numeric or bigint values into INR currency strings with safety checks.",
  "frontend/src/utils/maskAadhaar.ts": "Masks Aadhaar numbers by replacing all but the last four digits with placeholders.",
  "frontend/src/utils/onboardingStorage.ts": "Handles saving, retrieving, and clearing customer, vendor, and outlet onboarding data in sessionStorage.",
  "frontend/src/utils/safeNumbers.ts": "Provides safe numeric conversions, formatting, string conversion, and value sanitization utilities.",
  "frontend/src/utils/statusStyles.ts": "Maps order and UI statuses to class names and human‑readable text, including stock availability helpers.",
  "frontend/src/utils/urlParams.ts": "Manages URL and sessionStorage parameters, including retrieval, persistence, and cleanup functions.",
  "frontend/src/vite-env.d.ts": "Defines Vite environment types, including optional II URL for ImportMeta.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radius, shadows, animations, and plugins for typography, container queries, and animations.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related files, enabling strict ESNext module settings and including the Vite config.",
  "frontend/vite.config.ts": "Vite setup with React plugin, path aliases, environment shims, custom build chunks, and dev server config.",
  "project_state.json": "Describes project state and requirements, mainly defining the need to add full PWA support for QuickBazar."
}