{
  "backend/main.mo": "Main Motoko canister defining product, category, order, vendor, and profile data models with maps for storage and authorization via mixins.",
  "feature_evidence.json": "Feature evidence report listing theme‑token updates and CTA button work with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of multiple frontend pages and components, especially admin, vendor, customer pages, and CTA button usage.",
  "frontend/index.css": "Root Tailwind OKLCH CSS variables for theme colors plus base styles for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "App routing setup using TanStack Router with role‑protected routes for admin, vendor, and user pages.",
  "frontend/src/components/AppLayout.tsx": "Global app layout with top nav, bottom nav, content area, and profile setup modal.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with options to return home or contact support.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout with status display and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal prompting new users to enter profile details and saves them via backend mutation.",
  "frontend/src/components/auth/RequireRole.tsx": "Guards routes by checking user authentication and role, rendering AccessDeniedScreen when unauthorized.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar with icons, active‑state styling, and cart badge using cart query data.",
  "frontend/src/components/buttons/PrimaryCtaButton.tsx": "A wrapper around Button applying primary CTA styles.",
  "frontend/src/components/HeroBannerSlider.tsx": "Auto‑rotating hero image slider with manual navigation buttons and slide indicators.",
  "frontend/src/components/ProductGrid.tsx": "Renders a grid of products with images, discounts, wishlist/cart actions, and loading skeletons.",
  "frontend/src/components/TopNav.tsx": "Provides the top navigation bar with search, cart count, user actions, and mobile menu.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user, role, product, and vendor-related data through the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and theme variables, plus custom utility classes and gradient button styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page describing the platform’s mission and features with styled cards and icons.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard displaying product, order, vendor stats and a bar chart overview.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin orders list with status display and controls to update each order's status.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin page for listing, creating, editing, and deleting products using dialogs and backend mutations.",
  "frontend/src/pages/admin/AdminVendorsPage.tsx": "Admin interface to add and remove vendors by principal ID with a form dialog and vendor list.",
  "frontend/src/pages/CartPage.tsx": "Displays and manages the user’s shopping cart, handling quantity updates, removal, subtotal calculation, and checkout navigation.",
  "frontend/src/pages/CategoriesPage.tsx": "Fetches and displays a grid of product categories with loading skeletons and clickable category cards.",
  "frontend/src/pages/CategoryListingPage.tsx": "Shows products for a selected category with sorting controls and filtered product grid rendering.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that displays cart items, calculates totals, and submits an order before clearing the cart.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with validation and simulated submission plus contact info cards.",
  "frontend/src/pages/customer/CustomerProfilePage.tsx": "Customer profile page allowing users to view their principal and update personal details.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Displays a customer's order history with status badges, dates, item counts, and totals.",
  "frontend/src/pages/customer/WishlistPage.tsx": "Shows wishlist items by filtering products based on stored wishlist IDs.",
  "frontend/src/pages/HomePage.tsx": "Home page showing hero slider, category list, deals, and featured products fetched from APIs.",
  "frontend/src/pages/ProductPage.tsx": "Product details page with image carousel, pricing, cart/wishlist actions, and review submission.",
  "frontend/src/pages/vendor/VendorDashboardPage.tsx": "Vendor dashboard summarizing product count, orders, revenue, and offering navigation actions.",
  "frontend/src/pages/vendor/VendorOrdersPage.tsx": "Vendor view of orders including status, customer, date, items, and total amounts.",
  "frontend/src/pages/vendor/VendorProductsPage.tsx": "React page for vendors to list, add, edit, and delete products using form dialogs and query hooks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and removing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project state file describing the e-commerce app’s features, schema version, and capabilities."
}