{
  "backend/main.mo": "Defines the backend actor with product, vendor, order, user, and storage types plus maps for storing marketplace data and authorization mixins.",
  "feature_evidence.json": "Lists feature evidence for PWA manifest completeness, icons, service worker behavior, and A2HS support with associated files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose and UI behavior of various frontend React pages and components.",
  "frontend/DEPLOYMENT.md": "Explains fixes for production build issues, including adding tsconfig files and shimming process.env via Vite.",
  "frontend/index.css": "Tailwind CSS base and theme variable setup using OKLCH color tokens for light and dark modes.",
  "frontend/index.html": "HTML entry file setting PWA metadata, linking the manifest and icons, and loading the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, colors, start URL, standalone mode, and a full icon set including maskable icons.",
  "frontend/public/offline.html": "Standalone offline fallback page with gradient branding, message, and retry button for service worker use.",
  "frontend/public/sw.js": "Service worker managing precaching, cache cleanup, and fetch strategies for offline support and asset caching.",
  "frontend/src/App.tsx": "Main router configuration defining all public, customer, vendor, and admin routes using TanStack Router within an AppLayout.",
  "frontend/src/components/admin/AdminErrorBoundary.tsx": "Provides an error boundary for admin pages, logging detailed diagnostics and showing a fallback UI. Includes copy-to-clipboard diagnostics for easier debugging.",
  "frontend/src/components/admin/AdminNav.tsx": "Displays the admin navigation tabs with links to dashboard sections. Highlights the active tab based on the current route.",
  "frontend/src/components/admin/VendorDocumentsDialog.tsx": "Shows a dialog listing a vendor’s uploaded documents with view and download options. Fetches documents based on the vendor’s principal.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper handling vendor post-login redirects and rendering top nav, bottom nav, and install banner around page content.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access-denied message with optional admin tools and diagnostic error details. Allows refreshing access or triggering admin-role assignment.",
  "frontend/src/components/auth/AdminBypass.tsx": "Wrapper that ensures a user is authenticated before viewing admin routes. Redirects unauthenticated users to the login page.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity auth. Handles login state, logout clearing, and recovery from already-authenticated errors.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Prompts newly authenticated users to create a profile when none exists. Saves name, email, phone, and address through backend mutation.",
  "frontend/src/components/auth/RequireRole.tsx": "Component that conditionally renders children based on required user role with detailed admin-state handling and access-denied logic.",
  "frontend/src/components/auth/SafeAdminGate.tsx": "Empty file; no implementation present.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar that switches menu items based on detected user role and shows cart badges and active states.",
  "frontend/src/components/buttons/PrimaryCtaButton.tsx": "Wrapper around Button that applies primary CTA styling and forwards props.",
  "frontend/src/components/DealCard.tsx": "Product deal card showing image, deal badge, discount pricing, and linking to the product page.",
  "frontend/src/components/forms/FloatingLabelInput.tsx": "Input component with floating label behavior using peer styling.",
  "frontend/src/components/HeroBannerSlider.tsx": "Auto-rotating, swipe-enabled hero banner slider that links users to store-category pages based on slide selection.",
  "frontend/src/components/ProductGrid.tsx": "Grid display for products with loading skeletons, discount and stock badges, and add-to-cart functionality.",
  "frontend/src/components/pwa/A2HSInstallBanner.tsx": "Banner prompting users to install the PWA, with install and dismiss actions driven by useA2HS state.",
  "frontend/src/components/status/OrderStatusBadge.tsx": "Badge that displays order status text and styling via utility helpers.",
  "frontend/src/components/TopNav.tsx": "Renders the main navigation bar with search, logo, user role detection, and cart count. Handles search navigation and adapts layout for desktop and mobile.",
  "frontend/src/components/vendor/EditOutletDialog.tsx": "Dialog form allowing vendors to edit outlet details, upload photos, and submit updates via mutation.",
  "frontend/src/components/vendor/VendorTabs.tsx": "Navigation tabs for vendor dashboard linking to main vendor routes with active-state styling.",
  "frontend/src/constants/storeCategories.ts": "Defines store category options and helpers for labels, parsing, and slugs.",
  "frontend/src/data/vendors.ts": "Static vendor list with basic shop metadata for sample or mock data.",
  "frontend/src/hooks/useA2HS.ts": "Hook managing add-to-home-screen installability, prompt handling, and install state.",
  "frontend/src/hooks/useActor.ts": "Creates and caches backend actor based on identity, initializing access control and invalidating dependent queries.",
  "frontend/src/hooks/useActorQueryState.ts": "Lightweight hook that reads actor query state from React Query cache via external store subscription.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity state and login helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines many React Query hooks for fetching and mutating backend data such as user profiles, roles, and vendor/customer info using an actor and identity.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables and utility classes for marketplace UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app by wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with sections describing the service's mission and features using styled cards and icons.",
  "frontend/src/pages/admin/AdminAnalyticsPage.tsx": "Fetches and displays admin analytics including vendor, order, sales, and commission stats.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with navigation cards for vendors, orders, and quick actions.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all orders with city filtering and allows admins to update order statuses.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Provides product management including listing, creating, editing, and deleting products.",
  "frontend/src/pages/admin/AdminVendorsPage.tsx": "Manages vendor approval, outlet status, payments, and document viewing.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's shopping cart, handles pricing and checkout navigation, and shows states for unauthenticated, loading, or empty carts.",
  "frontend/src/pages/CategoriesPage.tsx": "Fetches and displays product categories in a grid with loading skeletons and gradient-themed category cards.",
  "frontend/src/pages/CategoryListingPage.tsx": "Displays products for a selected category with sorting options and a product grid.",
  "frontend/src/pages/CheckoutPage.tsx": "Builds an order summary from cart items, calculates total, and submits an order before clearing the cart.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with validation and contact info cards, simulating message submission.",
  "frontend/src/pages/customer/CustomerProfilePage.tsx": "Shows the logged‑in customer’s profile details and role information.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Displays a customer’s order history with status badges and order details.",
  "frontend/src/pages/customer/WishlistPage.tsx": "Displays the user's wishlist by fetching wishlist and product data, showing loading skeletons, an empty state, or product cards with pricing and stock badges.",
  "frontend/src/pages/HomePage.tsx": "Shows hero banners, login buttons, featured deals, and category navigation cards.",
  "frontend/src/pages/onboarding/CustomerLoginPage.tsx": "Provides a customer login form with validation and saves login data before navigating to the vendor list based on the selected city.",
  "frontend/src/pages/onboarding/OutletDetailsPage.tsx": "Collects outlet details including photo upload and validates inputs, saving the data and navigating to the vendor dashboard upon completion.",
  "frontend/src/pages/onboarding/SimpleVendorDashboardPage.tsx": "Shows a vendor dashboard summarizing registration success and displaying outlet, location, and contact details from stored onboarding data.",
  "frontend/src/pages/onboarding/VendorListPage.tsx": "Lists vendors filtered by city, providing shop info and navigation to individual vendor pages, with empty states for missing or unmatched cities.",
  "frontend/src/pages/onboarding/VendorLoginPage.tsx": "Renders a vendor login form with validation and category selection, saving data and routing to the outlet details page upon success.",
  "frontend/src/pages/onboarding/VendorShopPage.tsx": "Displays a vendor’s shop details using a vendorId param, with fallback UI if the vendor is not found.",
  "frontend/src/pages/ProductPage.tsx": "Displays product details, image carousel, pricing, reviews, and supports adding to cart and posting reviews.",
  "frontend/src/pages/store/StoreCategoryVendorsPage.tsx": "Lists vendors for a given store category with loading, error, and empty states, and handles invalid category routes.",
  "frontend/src/pages/store/VendorShopPage.tsx": "Shows a vendor shop with owner-only product management including add, edit, delete, and image handling based on store category.",
  "frontend/src/pages/vendor/VendorDashboardPage.tsx": "Vendor dashboard showing product count, orders, sales, and wallet/outlet status alerts.",
  "frontend/src/pages/vendor/VendorOrdersPage.tsx": "Displays vendor orders with loading and empty states, showing order details and status.",
  "frontend/src/pages/vendor/VendorProductsPage.tsx": "Interface for vendors to view, add, edit, and delete products with a modal form and category support.",
  "frontend/src/pages/vendor/VendorProfilePage.tsx": "Renders the vendor profile page showing vendor info, outlet details, and loading states using queries and UI components.",
  "frontend/src/pages/vendor/VendorWalletPage.tsx": "Displays vendor wallet status, commission warnings, outlet disable alerts, and sales totals with loading handling.",
  "frontend/src/utils/categoryColors.ts": "Provides deterministic mapping of category IDs to predefined gradient color classes.",
  "frontend/src/utils/categoryMatch.ts": "Exports a helper to find a category by case-insensitive name match.",
  "frontend/src/utils/errors.ts": "Utilities for extracting, formatting, and generating diagnostics text from unknown errors.",
  "frontend/src/utils/formatInr.ts": "Formats bigint or number values into INR currency strings safely.",
  "frontend/src/utils/maskAadhaar.ts": "Masks Aadhaar numbers to show only the last four digits.",
  "frontend/src/utils/onboardingStorage.ts": "Handles saving, retrieving, and clearing onboarding-related data in sessionStorage for customers and vendors.",
  "frontend/src/utils/safeNumbers.ts": "Safe numeric conversion and formatting helpers to prevent crashes from invalid numbers.",
  "frontend/src/utils/statusStyles.ts": "Maps order and UI statuses to class names and text labels, including stock availability styles.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with sessionStorage fallback.",
  "frontend/src/vite-env.d.ts": "Type declarations for Vite environment variables.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended color system, custom radii, shadows, and accordion animations using several plugins.",
  "frontend/tsconfig.node.json": "Sets TypeScript options for Vite’s Node-side config with strict mode, no emit, and ESNext module resolution.",
  "frontend/vite.config.ts": "Defines Vite build and dev-server settings, React plugin, path aliasing, env shims, manual chunking, and esbuild global definitions.",
  "project_state.json": "Tracks project state for adding full PWA installability including manifest, icons, service worker, offline caching, and mobile install prompt."
}