{
  "backend/main.mo": "Main Motoko actor defining marketplace types, storage maps, and authorization logic with initial admin setup and vendor/admin helper checks.",
  "backend/migration.mo": "Migration module converting old actor state to the new format, including list-to-array conversions and vendor/order structure upgrades.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to corresponding frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing UI pages, components, styling, and behavior.",
  "frontend/DEPLOYMENT.md": "Deployment notes detailing fixes for production build issues related to Vite environment variables and missing configuration files.",
  "frontend/index.css": "Global Tailwind CSS variables and theming definitions for light and dark modes.",
  "frontend/index.html": "Base HTML entry point setting metadata, loading the manifest, and mounting the React root.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and display behavior.",
  "frontend/public/offline.html": "Standalone offline fallback page with gradient styling and a retry button.",
  "frontend/public/sw.js": "Service worker handling precaching, cache cleanup, and network-first or cache-first fetching with offline fallback.",
  "frontend/src/App.tsx": "Main app router defining all frontend routes with role-based protection and shared layout.",
  "frontend/src/components/admin/AdminErrorBoundary.tsx": "Error boundary for admin pages that logs diagnostics and shows a styled fallback UI when rendering fails.",
  "frontend/src/components/admin/AdminNav.tsx": "Admin navigation tabs component linking to dashboard, vendors, orders, and products sections.",
  "frontend/src/components/AppLayout.tsx": "App layout component rendering top navigation, content area, and bottom navigation.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access-denied message with optional admin tools, backend error diagnostics, and refresh actions.",
  "frontend/src/components/auth/AdminBypass.tsx": "Wrapper that requires authentication for admin routes and redirects unauthenticated users to the login page.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that triggers Internet Identity authentication and manages query cache.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without a profile to create one using basic personal details.",
  "frontend/src/components/auth/RequireRole.tsx": "Role-based gatekeeper that checks admin/vendor/customer status and shows loading or denial screens accordingly.",
  "frontend/src/components/auth/SafeAdminGate.tsx": "Empty placeholder component file.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar that switches items based on user role and shows cart counts.",
  "frontend/src/components/buttons/PrimaryCtaButton.tsx": "Wrapper around Button applying a primary CTA gradient style.",
  "frontend/src/components/DealCard.tsx": "Card component displaying a product with image, deal badge, pricing, and discount handling.",
  "frontend/src/components/forms/FloatingLabelInput.tsx": "Floating input component combining an Input and Label with animated floating label behavior.",
  "frontend/src/components/HeroBannerSlider.tsx": "Auto-rotating hero banner slider with navigation buttons and slide indicators.",
  "frontend/src/components/ProductGrid.tsx": "Product grid list showing products with pricing, stock badges, images, and add‑to‑cart handling.",
  "frontend/src/components/status/OrderStatusBadge.tsx": "Badge component that displays order status using style and text helpers.",
  "frontend/src/components/TopNav.tsx": "Responsive top navigation bar with search, cart count, role-based links, and login handling.",
  "frontend/src/data/vendors.ts": "Static vendor list and interface defining vendor fields like shop name and location.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useActorQueryState.ts": "Hook that reads actor query state from React Query cache without triggering actor creation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth provider and hook handling login, stored identity, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, roles, and other backend data.",
  "frontend/src/index.css": "Tailwind base styles with custom color system, themes, utilities, and global styling.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Marketing about page describing QuickBazar with feature cards and styled sections.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with navigation cards for vendor management, orders, and quick administrative actions.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Shows all orders with filtering by city and allows admins to update order statuses.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Provides an admin interface to list, create, edit, and delete products using a modal form.",
  "frontend/src/pages/admin/AdminVendorsPage.tsx": "Displays vendor list with actions to approve, reject, toggle outlet status, and view vendor documents.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart, merges cart items with product data, calculates totals, and handles checkout navigation with identity checks.",
  "frontend/src/pages/CategoriesPage.tsx": "Fetches and lists all categories with loading skeletons, showing each as a clickable card with styled icons.",
  "frontend/src/pages/CategoryListingPage.tsx": "Shows products filtered by category with sorting options and uses ProductGrid to display results.",
  "frontend/src/pages/CheckoutPage.tsx": "Builds an order summary from cart items, calculates totals, and submits a new order while clearing the cart on success.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with validation and simulated submission plus static contact info cards.",
  "frontend/src/pages/customer/CustomerProfilePage.tsx": "Shows the logged‑in customer’s profile details including principal ID, name, email, phone, and address.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Displays a customer's orders with loading state, empty state, and order cards showing status, date, items, and total.",
  "frontend/src/pages/customer/WishlistPage.tsx": "Fetches and displays wishlist items with loading skeletons, empty state, product cards, images, discounts, and stock badges.",
  "frontend/src/pages/HomePage.tsx": "Home landing page with hero slider, login buttons, deals section, and feature highlights using fetched products.",
  "frontend/src/pages/onboarding/CustomerLoginPage.tsx": "Provides a customer login form with validation, storing data, and navigating to the vendor list based on selected city.",
  "frontend/src/pages/onboarding/OutletDetailsPage.tsx": "Collects outlet details with photo upload, validation, and saves data before navigating to the vendor dashboard.",
  "frontend/src/pages/onboarding/SimpleVendorDashboardPage.tsx": "Shows a simple vendor dashboard with registration success info, outlet data, and vendor contact/location details.",
  "frontend/src/pages/onboarding/VendorListPage.tsx": "Lists vendors filtered by city with empty state handling and navigation to individual vendor shops.",
  "frontend/src/pages/onboarding/VendorLoginPage.tsx": "Form page for vendor login collecting basic details with validation and navigation to outlet details.",
  "frontend/src/pages/onboarding/VendorShopPage.tsx": "Displays vendor shop info based on vendorId, showing location and contact or a not-found state.",
  "frontend/src/pages/ProductPage.tsx": "Displays a product detail page with image carousel, pricing, availability, add‑to‑cart, and review submission features.",
  "frontend/src/pages/vendor/VendorDashboardPage.tsx": "Vendor dashboard showing wallet due, sales, outlet info, and status using data from backend queries.",
  "frontend/src/pages/vendor/VendorOrdersPage.tsx": "Lists vendor orders with status, details, and empty/loading states using backend query data.",
  "frontend/src/pages/vendor/VendorProductsPage.tsx": "Manages vendor products with add, edit, delete dialogs, syncing updates through backend hooks.",
  "frontend/src/utils/categoryColors.ts": "Maps category IDs to deterministic gradient color classes using a simple hash.",
  "frontend/src/utils/categoryMatch.ts": "Provides case-insensitive lookup of categories by name.",
  "frontend/src/utils/errors.ts": "Utilities to extract, format, and display friendly error messages and diagnostics.",
  "frontend/src/utils/formatInr.ts": "Formats numeric or bigint amounts into INR currency strings.",
  "frontend/src/utils/onboardingStorage.ts": "Provides functions to save, retrieve, and clear customer, vendor, and outlet onboarding data in sessionStorage.",
  "frontend/src/utils/safeNumbers.ts": "Contains safe numeric conversion, formatting, and sanitization helpers to prevent rendering errors.",
  "frontend/src/utils/statusStyles.ts": "Maps order and UI statuses to display text and CSS class names, and computes stock availability styling.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and removing URL parameters using query strings, hash, and sessionStorage.",
  "frontend/src/vite-env.d.ts": "Defines Vite environment variable typings for the project.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins including typography and container queries.",
  "project_state.json": "Describes the project’s state, existing features, and requested enhancements for the admin control panel."
}