{
  "backend/main.mo": "Main backend actor defining marketplace data models, storage maps, access control, and user profile operations with mixins for authorization and blob storage.",
  "backend/migration.mo": "Migration module converting old orders and vendors to new structures by adding commissionApplied and extended vendor profile fields.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing various frontend pages, components, and styling.",
  "frontend/DEPLOYMENT.md": "Deployment notes detailing fixes for frontend build failures, including TypeScript config additions and Vite environment shims.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining light/dark theme color variables and base element styles.",
  "frontend/index.html": "Base HTML template mounting the React app and loading the main frontend script.",
  "frontend/public/manifest.webmanifest": "Web app manifest defining PWA metadata, theme colors, icons, and display behavior.",
  "frontend/public/offline.html": "Standalone offline fallback page with styled message and retry button.",
  "frontend/public/sw.js": "Service worker implementing precaching, cache cleanup, and network-first or cache-first strategies with offline fallback.",
  "frontend/src/App.tsx": "Main app routing setup using TanStack Router, defining all customer, vendor, and admin routes with role-based guards.",
  "frontend/src/components/admin/AdminErrorBoundary.tsx": "Provides an admin‑specific error boundary that logs errors and shows a diagnostic fallback UI with copyable details.",
  "frontend/src/components/admin/AdminNav.tsx": "Renders tab‑based navigation for admin sections using the current route to highlight active tabs.",
  "frontend/src/components/admin/VendorDocumentsDialog.tsx": "Shows vendor documents in a dialog with loading, empty, view, and download states.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper handling vendor auto-redirect after login and rendering top navigation, content area, and bottom navigation.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access‑denied screen with optional admin‑assignment, diagnostics, and access‑refresh functionality.",
  "frontend/src/components/auth/AdminBypass.tsx": "Simple wrapper that requires authentication for admin pages and redirects unauthenticated users while showing a loading state during initialization.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity and handles clearing queries after logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal prompting new authenticated users to enter profile details and saves them via a mutation.",
  "frontend/src/components/auth/RequireRole.tsx": "Wraps children with role-based access control, handling admin/vendor/customer checks and loading/error states.",
  "frontend/src/components/auth/SafeAdminGate.tsx": "Empty placeholder file defining no functionality.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar that switches menu items based on user role and displays cart badge and active state highlighting.",
  "frontend/src/components/buttons/PrimaryCtaButton.tsx": "A styled wrapper around the base Button component applying a primary gradient style.",
  "frontend/src/components/DealCard.tsx": "Product deal card showing image, pricing, discount, and deal type badge with link to product page.",
  "frontend/src/components/forms/FloatingLabelInput.tsx": "Input component with floating label behavior using peer-based styling.",
  "frontend/src/components/HeroBannerSlider.tsx": "Auto-rotating banner slider with manual navigation buttons and slide indicators.",
  "frontend/src/components/ProductGrid.tsx": "Displays a responsive product grid with images, pricing, discounts, stock status, and add‑to‑cart handling, with skeletons for loading states.",
  "frontend/src/components/status/OrderStatusBadge.tsx": "Shows an order status badge using helper functions to determine label and styling.",
  "frontend/src/components/TopNav.tsx": "Implements the main site navigation bar with search, role‑aware actions, cart count, mobile drawer, and branding.",
  "frontend/src/components/vendor/EditOutletDialog.tsx": "Dialog allowing vendors to edit outlet details, manage photo uploads, and submit updates via mutation.",
  "frontend/src/components/vendor/VendorTabs.tsx": "Renders vendor navigation tabs with icons and active-state styling.",
  "frontend/src/data/vendors.ts": "Exports sample vendor data and a VendorData interface.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on authentication, initializing access control and invalidating dependent queries.",
  "frontend/src/hooks/useActorQueryState.ts": "Exposes actor query status by subscribing to React Query's cache without recreating the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication, handling identity persistence, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, and other backend data using an actor and identity context.",
  "frontend/src/index.css": "Configures Tailwind CSS layers and theme variables for light/dark modes, including color system, shadows, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with mission text and feature cards highlighting platform benefits.",
  "frontend/src/pages/admin/AdminAnalyticsPage.tsx": "Fetches and displays admin analytics including vendors, orders, sales, and commission data.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with navigation, control panel cards for vendor and order management, and quick action buttons.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays and filters orders by city, allows updating order status, and shows order details in a table.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Provides an interface to add, edit, and delete products using dialogs and form inputs.",
  "frontend/src/pages/admin/AdminVendorsPage.tsx": "Manages vendors with approval, rejection, outlet status toggling, payment marking, and document viewing.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart with product details, price calculations, and checkout handling based on authentication state.",
  "frontend/src/pages/CategoriesPage.tsx": "Lists all product categories with loading skeletons and styled image cards linking to category pages.",
  "frontend/src/pages/CategoryListingPage.tsx": "Displays products for a given category with sorting options and filtering by active status.",
  "frontend/src/pages/CheckoutPage.tsx": "Builds an order summary from cart items and submits an order after validating identity and cart state.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with basic validation and static contact details.",
  "frontend/src/pages/customer/CustomerProfilePage.tsx": "Shows the logged‑in customer’s profile details including principal, name, email, phone, and address.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Lists the customer's orders with status badges and basic order details, showing a loading or empty state when applicable.",
  "frontend/src/pages/customer/WishlistPage.tsx": "Displays the user's wishlist by fetching wishlist IDs and matching products, showing loading skeletons, empty state, and product cards with discounts and stock badges.",
  "frontend/src/pages/HomePage.tsx": "Shows homepage with hero slider, login buttons, deal products, and feature highlights.",
  "frontend/src/pages/onboarding/CustomerLoginPage.tsx": "Provides a customer login form with validation and saves the data before navigating to the vendor list filtered by city.",
  "frontend/src/pages/onboarding/OutletDetailsPage.tsx": "Collects outlet details including photo upload and validates inputs before saving and navigating to the vendor dashboard.",
  "frontend/src/pages/onboarding/SimpleVendorDashboardPage.tsx": "Shows a simple vendor dashboard summarizing vendor and outlet details after onboarding, including outlet photo and contact info.",
  "frontend/src/pages/onboarding/VendorListPage.tsx": "Displays a list of vendors filtered by selected city, with empty states and navigation to vendor shop pages.",
  "frontend/src/pages/onboarding/VendorLoginPage.tsx": "Handles vendor login with form validation and saves login data before navigating to outlet details.",
  "frontend/src/pages/onboarding/VendorShopPage.tsx": "Displays vendor details or a not-found message, with navigation back to vendor listings.",
  "frontend/src/pages/ProductPage.tsx": "Displays product details, image carousel, pricing, reviews, and supports adding to cart and submitting reviews.",
  "frontend/src/pages/vendor/VendorDashboardPage.tsx": "Shows vendor dashboard stats, wallet alerts, and sales summaries with loading states.",
  "frontend/src/pages/vendor/VendorOrdersPage.tsx": "Lists vendor orders with status, dates, and totals, handling loading and empty states.",
  "frontend/src/pages/vendor/VendorProductsPage.tsx": "Manages vendor products with create, edit, and delete functionality using a dialog form.",
  "frontend/src/pages/vendor/VendorProfilePage.tsx": "Displays vendor profile and outlet details with edit support and verification status.",
  "frontend/src/pages/vendor/VendorWalletPage.tsx": "Shows wallet due, sales, and commission with alerts for limit thresholds.",
  "frontend/src/utils/categoryColors.ts": "Maps category IDs to deterministic gradient color classes via a hash.",
  "frontend/src/utils/categoryMatch.ts": "Provides case-insensitive lookup of a category by name.",
  "frontend/src/utils/errors.ts": "Helpers to extract readable messages from unknown errors and build diagnostics text blocks.",
  "frontend/src/utils/formatInr.ts": "Formats bigint or number amounts into INR strings with ₹ and localized formatting.",
  "frontend/src/utils/maskAadhaar.ts": "Masks Aadhaar numbers to show only the last four digits.",
  "frontend/src/utils/onboardingStorage.ts": "SessionStorage helpers for saving, retrieving, and clearing customer, vendor, and outlet onboarding data.",
  "frontend/src/utils/safeNumbers.ts": "Safe conversion and formatting utilities for bigint and numbers to avoid non-finite values.",
  "frontend/src/utils/statusStyles.ts": "Maps order and UI statuses to class names and labels, plus availability status helpers.",
  "frontend/src/utils/urlParams.ts": "Utilities to read, persist, and clear URL parameters using query strings, hash, and sessionStorage.",
  "frontend/src/vite-env.d.ts": "Vite environment type definitions including optional VITE_II_URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended colors, radii, shadows, animations, and plugins.",
  "frontend/tsconfig.node.json": "Node-specific TypeScript config for Vite with strict options and no emission.",
  "frontend/vite.config.ts": "Vite config for React with path aliasing, env shims, chunk splitting, and dev server settings.",
  "project_state.json": "Project state metadata covering wallet rules, outlet behavior, UI requirements, and feature tracking."
}