{
  "backend/main.mo": "Motoko canister defining marketplace data types, vendor authorization, and in-memory maps for products, orders, carts, discounts, and profiles, with storage and access-control mixins.",
  "feature_evidence.json": "Feature evidence report mapping UI/UX updates to impacted files, components, and test IDs with high-confidence feature tracking metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and UI style of various frontend pages and components in the project.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing fixes for TypeScript config issues and Vite environment variable shimming required for successful production builds.",
  "frontend/index.css": "Root Tailwind theme file defining OKLCH color tokens, dark mode variables, and base element styling for borders and backgrounds.",
  "frontend/index.html": "Main HTML entrypoint that sets up meta tags, PWA settings, and loads the React application root container and main script.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, icons, and startup configuration for QuickBazar.",
  "frontend/public/offline.html": "Standalone offline fallback page with gradient styling and a retry button for when the user has no internet connection.",
  "frontend/public/sw.js": "Service worker handling precaching, cache cleanup, and network-first or cache-first fetch strategies with offline fallback.",
  "frontend/src/App.tsx": "Main app router configuration defining routes, layouts, and role-protected pages for customer, vendor, and admin flows.",
  "frontend/src/components/admin/AdminErrorBoundary.tsx": "Error boundary for admin pages that logs errors and shows a diagnostic fallback UI.",
  "frontend/src/components/admin/AdminNav.tsx": "Admin navigation tabs linking to dashboard sections with active-state highlighting.",
  "frontend/src/components/admin/VendorDocumentsDialog.tsx": "Dialog that loads and displays vendor-submitted documents with view and download options.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper with top/bottom navigation and vendor auto-redirect logic after login.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Access denial screen with admin refresh, role assignment handling, and backend error diagnostics.",
  "frontend/src/components/auth/AdminBypass.tsx": "Wrapper that restricts admin routes to authenticated users and redirects unauthenticated users.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that triggers Internet Identity authentication and clears cached queries.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save initial profile details.",
  "frontend/src/components/auth/RequireRole.tsx": "Role-gating component that checks admin/vendor access using actor and role queries, showing loading or denial states until checks complete.",
  "frontend/src/components/auth/SafeAdminGate.tsx": "Empty file.",
  "frontend/src/components/BottomNav.tsx": "Responsive bottom navigation that adapts links based on user role and shows cart badges for customers.",
  "frontend/src/components/buttons/PrimaryCtaButton.tsx": "Wrapper around Button that applies primary CTA styles and forwards props.",
  "frontend/src/components/DealCard.tsx": "Product deal card showing image, pricing, discount, and styled deal badges linking to product detail.",
  "frontend/src/components/forms/FloatingLabelInput.tsx": "Input with floating label behavior using peer styling and custom classes.",
  "frontend/src/components/HeroBannerSlider.tsx": "Auto-rotating hero banner slider with swipe gestures, category-based slides, and navigation to store categories.",
  "frontend/src/components/ProductGrid.tsx": "Responsive product grid showing product cards with image, price, discount, stock status, and add‑to‑cart handling.",
  "frontend/src/components/status/OrderStatusBadge.tsx": "Badge component that renders styled order status text based on helper functions.",
  "frontend/src/components/TopNav.tsx": "Responsive top navigation bar providing search, logo, cart count, role-based links, and login handling.",
  "frontend/src/components/vendor/EditOutletDialog.tsx": "Dialog form for editing vendor outlet details, including photo upload and mutation handling.",
  "frontend/src/components/vendor/VendorTabs.tsx": "Vendor navigation tabs that highlight the active route and link to vendor sections.",
  "frontend/src/constants/storeCategories.ts": "Defines store category options with helpers for labels, parsing, and slugs.",
  "frontend/src/data/vendors.ts": "Static mock vendor dataset with basic shop info.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, reinitializing on identity changes.",
  "frontend/src/hooks/useActorQueryState.ts": "Reads actor query state from React Query cache via external store subscription.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hook managing authentication, stored identities, and login status.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, roles, permissions, and other backend data via the actor interface.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles, custom color variables, dark mode themes, and utility classes for marketplace UI elements.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission details and feature cards highlighting security, quality, and delivery.",
  "frontend/src/pages/admin/AdminAnalyticsPage.tsx": "Fetches and displays admin analytics metrics including vendors, orders, sales, and commission.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin control panel with navigation cards for vendor and order management along with quick action buttons.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays and filters orders by city, shows order details, and allows updating order statuses.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Manages product CRUD operations with a dialog form for adding and editing products.",
  "frontend/src/pages/admin/AdminVendorsPage.tsx": "Lists vendors and provides tools to approve, reject, toggle outlet status, view documents, and mark payments.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart, calculates totals, handles checkout navigation, and shows empty or loading states.",
  "frontend/src/pages/CategoriesPage.tsx": "Fetches and lists product categories using styled cards, with loading skeletons during fetch.",
  "frontend/src/pages/CategoryListingPage.tsx": "Shows products filtered by category with sorting options and reuses ProductGrid for display.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow, calculates totals, and submits orders while clearing the cart and validating identity.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form with validation and simulated submission plus contact info cards.",
  "frontend/src/pages/customer/CustomerProfilePage.tsx": "Shows the logged‑in customer’s profile details and role using Internet Identity data.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Displays a customer's order history with status indicators or an empty state if none exist.",
  "frontend/src/pages/customer/WishlistPage.tsx": "Displays the user's wishlist by fetching products and wishlist data, showing loading skeletons, empty state, or product cards with discounts and stock badges.",
  "frontend/src/pages/HomePage.tsx": "Displays hero slider, login buttons, and category cards, and shows deal products from fetched data.",
  "frontend/src/pages/onboarding/CustomerLoginPage.tsx": "Provides a customer login form with validation, saving data to storage and redirecting to the vendor list by city.",
  "frontend/src/pages/onboarding/OutletDetailsPage.tsx": "Collects vendor outlet details including photo upload, validates input, stores the data, and redirects to the vendor dashboard.",
  "frontend/src/pages/onboarding/SimpleVendorDashboardPage.tsx": "Shows a simple vendor dashboard with registration confirmation and displays stored vendor and outlet details.",
  "frontend/src/pages/onboarding/VendorListPage.tsx": "Lists vendors filtered by city, showing shop details and navigation to vendor shop pages, with empty states when needed.",
  "frontend/src/pages/onboarding/VendorLoginPage.tsx": "Provides a vendor login form with validation, saving details including store category and redirecting to outlet details.",
  "frontend/src/pages/onboarding/VendorShopPage.tsx": "Displays vendor details from local data using vendorId and shows a not‑found state if missing.",
  "frontend/src/pages/ProductPage.tsx": "Shows product details, image carousel, reviews, pricing, and allows adding to cart and submitting reviews.",
  "frontend/src/pages/store/StoreCategoryVendorsPage.tsx": "Lists vendors by store category with loading, error, and empty states plus category validation.",
  "frontend/src/pages/store/VendorShopPage.tsx": "Shows vendor details and lets vendor owners manage products with add, edit, delete, and image upload features.",
  "frontend/src/pages/vendor/VendorDashboardPage.tsx": "Vendor dashboard showing product count, orders, wallet due warnings, and loading states.",
  "frontend/src/pages/vendor/VendorOrdersPage.tsx": "Displays vendor orders with statuses and details, including empty and loading states.",
  "frontend/src/pages/vendor/VendorProductsPage.tsx": "Allows vendors to view, add, edit, and delete their products via a modal form and product list.",
  "frontend/src/pages/vendor/VendorProfilePage.tsx": "Renders the vendor profile page, showing vendor details, outlet info, and loading states using hooks and UI components.",
  "frontend/src/pages/vendor/VendorWalletPage.tsx": "Displays vendor wallet status, commission warnings, and sales totals with conditional alerts and loading handling.",
  "frontend/src/utils/categoryColors.ts": "Provides deterministic color classes for categories based on a simple hash of the category ID.",
  "frontend/src/utils/categoryMatch.ts": "Finds a category by case‑insensitive name matching within a list.",
  "frontend/src/utils/errors.ts": "Extracts readable error messages, formats diagnostics output, and handles backend trap/reject parsing.",
  "frontend/src/utils/formatInr.ts": "Formats numbers or bigints into INR currency strings with safe fallbacks.",
  "frontend/src/utils/maskAadhaar.ts": "Masks Aadhaar numbers to show only the last four digits in a fixed pattern.",
  "frontend/src/utils/onboardingStorage.ts": "Manages saving, retrieving, and clearing onboarding data in sessionStorage for customers, vendors, and outlets.",
  "frontend/src/utils/safeNumbers.ts": "Provides safe numeric conversions and formatting helpers to prevent crashes from invalid values.",
  "frontend/src/utils/statusStyles.ts": "Maps order and UI statuses to text and class names, and provides stock availability styling.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, persisting, and clearing URL parameters with sessionStorage fallback.",
  "frontend/src/vite-env.d.ts": "Defines Vite environment type declarations including optional II URL.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color tokens, extended radii, shadows, animations, and plugins for typography, container queries, and animations.",
  "frontend/tsconfig.node.json": "TypeScript config for Vite’s Node-side files with strict settings and ESNext module resolution.",
  "frontend/vite.config.ts": "Vite config enabling React, path aliasing, environment shims, build chunk splitting, and dev server settings.",
  "project_state.json": "Project metadata describing the marketplace UI theme, design system guidelines, and existing implemented features."
}