{
  "kind": "build_request",
  "title": "Fix blank /admin page by handling actor initialization failures and showing actionable admin diagnostics",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Prevent /admin routes from rendering a blank/loading-only screen when the backend actor fails to initialize (e.g., _initializeAccessControlWithSecret errors) by detecting the React Query actor query error state and rendering an explicit, user-visible error screen instead.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "ab yeh admin page mein kuch show ho nahi raha"
        ]
      },
      "acceptanceCriteria": [
        "If the actor React Query is in an error state, /admin shows an error UI (not a blank page and not an infinite skeleton).",
        "The error UI includes a short, English explanation that initialization failed and prompts the user to retry/refresh access.",
        "The UI works consistently for /admin, /admin/products, /admin/vendors, and /admin/orders."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Update frontend/src/components/auth/RequireRole.tsx to include actor query state awareness for admin protection: if identity exists but the actor query is errored or the actor is null due to an initialization failure, render AccessDeniedScreen with admin diagnostics enabled (showAdminButton) and include the underlying actor error message when available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "admin page mein kuch show ho nahi raha"
        ]
      },
      "acceptanceCriteria": [
        "When identity is present and the actor query has status=error, RequireRole(requiredRole='admin') renders AccessDeniedScreen with showAdminButton=true.",
        "AccessDeniedScreen shows an English message that includes (or is derived from) the actor initialization error when available from the query state.",
        "When the actor query is pending, RequireRole shows the loading skeleton; when it succeeds, RequireRole proceeds with the existing deterministic admin state machine."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Add a lightweight, structured console log when /admin enters the actor-initialization-failed path, including principal (if available), actor query status, and whether the caffeineAdminToken parameter is present, to aid debugging of admin access flakiness.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ]
      },
      "acceptanceCriteria": [
        "A single structured console message is emitted when transitioning into the actor-init-failed AccessDenied state for admin routes (and not spammed on every render).",
        "The log includes principal (if available), actor query status, and token-present boolean."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Add a global React error boundary (or route-level error boundary) around admin pages so that runtime rendering exceptions in admin screens (e.g., charts/components) display a visible fallback message instead of a blank page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ]
      },
      "acceptanceCriteria": [
        "If an admin page throws during render, the app displays an English fallback UI with a safe navigation option (e.g., Go to Home) instead of rendering blank content.",
        "The error boundary does not break non-admin routes."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn/ui sources are read-only).",
    "Do not edit immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Keep role capability enforcement intact; only improve failure/edge-case handling so the admin page never appears blank."
  ],
  "nonGoals": [
    "Changing backend authorization rules or admin token semantics.",
    "Adding new admin features or analytics metrics beyond fixing visibility and diagnostics."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}