{
  "kind": "build_request",
  "title": "Add vendor wallet commission enforcement and outlet profile management",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the commission logic so that a 10% commission is added to a vendor’s wallet due only when an order transitions to status \"delivered\" (not when the order is created). Ensure the commission is applied exactly once per order (i.e., changing status to \"delivered\" multiple times must not keep increasing wallet due).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Auto add 10% commission per delivered order."
        ]
      },
      "acceptanceCriteria": [
        "Creating an order does not change vendor.walletDue.",
        "Updating an order from any non-delivered status to delivered increases vendor.walletDue by floor(order.total * 0.10).",
        "Updating an already-delivered order to delivered again does not change vendor.walletDue.",
        "If an order is updated to delivered by an admin or the vendor, the same delivered-transition behavior applies."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Enforce the wallet limit rule: when vendor.walletDue becomes >= 1000 due to commission accrual, automatically set the vendor’s outletStatus to \"disabled\" in the backend. When the outlet is disabled, customer-facing product listings must not include products belonging to that vendor (i.e., hide disabled-outlet products from customers).",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "If wallet_due >= 1000:\n- Auto disable vendor outlet\n- Hide products from customers\n- Show red warning banner"
        ]
      },
      "acceptanceCriteria": [
        "After a delivered order causes walletDue to reach or exceed 1000, getCallerVendor() returns outletStatus = disabled for that vendor.",
        "Customer-facing product feeds returned by the backend (e.g., getAllProducts()) do not include products whose vendor outletStatus is disabled.",
        "Vendor-facing product feeds (e.g., getVendorProducts()) still return the vendor’s own products regardless of outletStatus."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update vendor-facing UI to show a wallet panel that includes: Wallet Due, Commission Rate (fixed at 10%), and Limit (fixed at 1000). When walletDue >= 1000 and/or outletStatus is disabled, show a prominent red warning banner on vendor dashboard and vendor wallet pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Show wallet panel:\n- Wallet due\n- Commission rate = 10%\n- Limit = 1000\n\nIf wallet_due >= 1000:\n- Auto disable vendor outlet\n- Hide products from customers\n- Show red warning banner"
        ]
      },
      "acceptanceCriteria": [
        "Vendor wallet page displays Wallet Due, Commission Rate: 10%, and Limit: ₹1,000.",
        "Vendor dashboard page shows a destructive (red) warning banner when walletDue >= 1000 or outletStatus is disabled.",
        "All user-facing warning/banner text is in English."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add an \"Outlet Profile\" section for vendors that displays: Outlet Name, Photo, Mobile, City, Area, Aadhaar (masked), and GST (optional). Aadhaar must be displayed in a masked form (do not show the full Aadhaar value in the UI).",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Add Outlet Profile section:\n- Outlet name\n- Photo\n- Mobile\n- City\n- Area\n- Aadhaar masked\n- GST optional"
        ]
      },
      "acceptanceCriteria": [
        "Backend vendor record includes fields necessary to persist Outlet Profile information (including an optional GST field).",
        "Vendor profile page displays all requested outlet profile fields when present.",
        "Aadhaar is shown masked in the vendor profile UI (e.g., only last digits visible; exact masking format is consistent)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add an \"Edit Outlet\" button in the vendor profile area that allows the vendor to update Outlet Profile fields (including changing the outlet photo). Persist the changes to the backend and refresh relevant vendor queries so the updated profile appears immediately after saving.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Add Edit Outlet button."
        ]
      },
      "acceptanceCriteria": [
        "An \"Edit Outlet\" button is visible on the vendor profile page.",
        "Saving edits persists the updated outlet profile to the backend and the vendor profile UI reflects changes without a full page reload.",
        "GST can be left empty/cleared and remains optional.",
        "Aadhaar is not stored/displayed as an unmasked full number via the vendor profile UI."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Adding external payment gateways or automated commission settlement.",
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Implementing real-time updates via WebSockets."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}