{
  "kind": "build_request",
  "title": "Apply colorful Amazon-style mobile-first marketplace UI theme across the entire app",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the global Tailwind theme tokens and shared utility classes to match the requested marketplace palette and styling rules: primary orange, secondary purple, success green, destructive red alerts, and light backgrounds; rounded corners throughout; soft card shadows; bold headings; mobile-friendly spacing; and gradient-filled buttons.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Apply a full colorful mobile-first marketplace UI theme across the entire app.\n\nUse bright Amazon-style design.\n\nCOLORS:\nPrimary orange, purple secondary, green success, red alerts, light backgrounds.\n\nGLOBAL STYLES:\n- Rounded corners everywhere\n- Soft shadows on cards\n- Gradient buttons\n- Bold headings\n- Large mobile-friendly spacing"
        ]
      },
      "acceptanceCriteria": [
        "Global theme variables in frontend/src/index.css reflect: primary=orange, secondary=purple, success=green, destructive=red, and a light background surface scheme.",
        "Tailwind config continues to map Tailwind color tokens (primary/secondary/success/destructive/background/card/etc.) to the CSS variables without breaking existing builds.",
        "A consistent set of reusable utility classes exists for: (a) primary gradient buttons and (b) standard marketplace cards (rounded + soft shadow + hover/tap interactions) that can be applied across pages.",
        "All changes remain mobile-first (spacing and typography scale appropriately on small screens first)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Standardize buttons across the app to use gradient-filled rounded buttons with bold text and soft shadow for primary actions, including banner CTAs, add-to-cart actions, and key dashboard actions; ensure hover/active/tap states feel responsive on mobile (scale/tap animation) while respecting reduced-motion preferences.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "BUTTONS:\nUse gradient filled rounded buttons with bold text and shadow."
        ]
      },
      "acceptanceCriteria": [
        "Primary action buttons visually match: gradient fill, rounded corners, bold label, and shadow.",
        "Mobile tap/active state provides a small tactile feedback (e.g., subtle scale-down/scale-up) and is disabled/reduced when prefers-reduced-motion is set.",
        "Existing button functionality (navigation, mutations, form submits) remains unchanged."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Apply a consistent card design system across the app for products, vendors, dashboards, and categories: rounded white cards, soft shadow, and clear borders; update pages/components that render these cards to use the shared card styling consistently.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "CARDS:\nUse rounded white cards with shadow for:\nproducts, vendors, dashboards, categories."
        ]
      },
      "acceptanceCriteria": [
        "Product, vendor, category, and dashboard cards consistently use rounded corners and soft shadows (no mixed sharp/flat card styles remain on major screens).",
        "Card hover/tap interactions are consistent (lift/hover shadow on pointer devices; tap feedback on mobile).",
        "Cards remain readable on light backgrounds with sufficient contrast for text and borders."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Revise category card UI (including the main Categories page and any category-card grids on the Home page) to use colorful gradient square cards with large icons and a tap animation, while preserving the existing category navigation behavior and category color mapping.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "CATEGORY CARDS:\nColorful gradient square cards with big icons and tap animation."
        ]
      },
      "acceptanceCriteria": [
        "Category cards are square (or near-square), show a colorful gradient background, and display the category icon prominently.",
        "Category cards have a visible tap animation on mobile (e.g., scale/press feedback) and do not rely solely on hover.",
        "Tapping a category still navigates to the correct category listing route as before."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Ensure product cards across the app follow the requested product-card pattern: image at the top, bold price, discounted/offer price clearly highlighted (with strikethrough original when applicable), and a full-width add-to-cart button; keep the layout compact and mobile-first.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "PRODUCT CARDS:\nImage top, bold price, offer price highlight, add-to-cart full button."
        ]
      },
      "acceptanceCriteria": [
        "Product cards show the main product image at the top and keep consistent rounded corners/shadows.",
        "When a discount exists, the final price is visually emphasized and the original price is de-emphasized (e.g., muted + strikethrough).",
        "Add-to-cart is a full-width gradient button on product cards where add-to-cart is present, and disabled styling is clear for out-of-stock states.",
        "No regression to product navigation (card click to product detail still works where implemented)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Update the hero/banner slider presentation to match the bright marketplace theme: gradient slider banners with bold text, and CTA buttons styled as gradient rounded buttons with mobile tap animation; keep swipe gestures, auto-rotation, and existing banner images intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "BANNERS:\nCreate gradient slider banners with bold text and CTA buttons."
        ]
      },
      "acceptanceCriteria": [
        "Hero banner slides maintain gradient overlays and bold typography, with improved marketplace-style visual richness consistent with the global theme.",
        "Banner CTA buttons use the same gradient rounded style as primary CTAs and provide tap feedback on mobile.",
        "Swipe left/right and auto-slide timing continue to work as before, and banner images remain loaded from the existing static asset paths."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Refresh vendor and admin dashboard visuals to use colored stat cards (sales, orders, wallet, alerts) aligned with the new theme palette (orange primary, purple secondary, green success, red alerts), keeping all existing dashboard data and logic unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "DASHBOARDS:\nUse colored stat cards for sales, orders, wallet, alerts."
        ]
      },
      "acceptanceCriteria": [
        "Dashboard stat cards use consistent rounded corners, soft shadows, and themed color accents that correspond to the requested palette.",
        "Alert states (warnings/errors) clearly use the red alerts styling and warning styling remains visually distinct on light backgrounds.",
        "No changes to what metrics are shown or how they are calculated; only UI presentation is updated."
      ]
    }
  ],
  "constraints": [
    "Frontend must remain React + TypeScript + Tailwind + shadcn + React Query.",
    "Do not edit any files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Do not introduce new backend canisters/services; keep the backend unchanged for this request."
  ],
  "nonGoals": [
    "Adding new marketplace features (payments, messaging, recommendations, real-time updates).",
    "Changing backend data models, authorization rules, or storage.",
    "Replacing existing banner/category/product images unless explicitly requested."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}