{
  "kind": "build_request",
  "title": "Fix /admin dashboard crash (React error #185) with defensive rendering and role gating",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Admin Dashboard page crash (Minified React error #185) by making AdminDashboardPage render-safe under all transient/invalid data conditions (undefined/null analytics object, missing fields, unexpected numeric values such as Infinity/NaN after bigint conversion).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Admin dashboard page is crashing with React error 185.\nFix admin dashboard component.\nAdd null checks and safe loading states."
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /admin never triggers AdminErrorBoundary for data-shape issues coming from analytics (null/undefined/partial fields).",
        "If analytics.totalRevenue (or any numeric field) converts to NaN/Infinity or otherwise invalid, the dashboard renders a safe fallback value (e.g., \"0\" / \"0.00\") and does not throw.",
        "Recharts section never throws due to invalid/empty chart data; when chart data is invalid/empty, an explicit empty-state UI is shown instead of rendering the chart."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure admin role data is defined before rendering the AdminDashboardPage content by adding explicit safe loading/guard behavior tied to admin-role resolution (do not render dashboard analytics/cards until the admin role check has deterministically completed).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Ensure admin role data is defined before rendering dashboard."
        ]
      },
      "acceptanceCriteria": [
        "While the admin role check is still loading/unfetched, the admin route shows a non-crashing loading state (skeleton/spinner) rather than attempting to render the dashboard.",
        "If the admin role check resolves to non-admin, the user is shown the existing access denied UI and the dashboard does not render.",
        "If the admin role check resolves to admin, the dashboard renders normally and proceeds to fetch/render analytics with safe loading/empty/error states."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (shadcn components are read-only).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding new admin features or changing admin navigation/routes beyond what is needed to prevent the crash.",
    "Backend schema changes or new backend APIs (unless strictly required to prevent the crash)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}