{
  "kind": "build_request",
  "title": "Make the UI more colorful across the storefront and portals",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Increase overall UI colorfulness across the app (storefront, customer, vendor, admin) by applying more intentional use of the existing theme palette (primary orange/yellow, secondary blue, accent green) in key surfaces and highlights (headers/nav, section headers, cards, chips/badges, focus states, and empty states) while keeping readability and contrast strong in both light and dark modes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ise aur colourful bana dijiye"
        ]
      },
      "acceptanceCriteria": [
        "Across Home, Categories, Product, Cart, Checkout, and the Admin/Vendor dashboards, visible accent color usage is increased beyond just the primary CTA buttons (e.g., colored section headers, chips, badges, and subtle tinted card backgrounds).",
        "Text remains readable: no primary/secondary/accent-colored backgrounds have low-contrast foreground text in either light or dark mode.",
        "No shadcn/ui immutable component source files are modified."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Enhance visual richness by adding subtle color gradients and tinted backgrounds using existing Tailwind theme tokens (e.g., soft primary/secondary/accent tints on hero overlays, category tiles, and key callout cards) and update hover/active states to feel more vibrant without reducing usability.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ise aur colourful bana dijiye"
        ]
      },
      "acceptanceCriteria": [
        "Hero/banner areas and category cards show subtle, tasteful color treatment (tints/gradients) that is consistent with the existing palette.",
        "Interactive elements (nav links, cards, product tiles, buttons) have clearer, more colorful hover/focus states than before.",
        "The UI does not become visually noisy: spacing and hierarchy remain clear and consistent."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make data/status elements more colorful and informative by applying consistent, palette-aligned styling to badges and status indicators (e.g., order status pills, stock/availability, success/error/info states) across customer/vendor/admin pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ise aur colourful bana dijiye"
        ]
      },
      "acceptanceCriteria": [
        "Order status badges/pills use distinct, consistent colors aligned to the theme (e.g., accent/success green, secondary blue, destructive, muted) and are readable.",
        "The same status value appears with the same styling anywhere it is rendered (customer orders, vendor orders, admin orders)."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text that changes as part of this work.",
    "Do not edit any files under the immutable shadcn/ui component sources (frontend/src/components/ui).",
    "Stay within the already-defined palette (primary orange/yellow, secondary blue, accent green) and keep strong contrast in light and dark modes."
  ],
  "nonGoals": [
    "No backend schema or Motoko logic changes.",
    "No new pages or new product features beyond visual/theme enhancements."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Increase saturation/contrast and add more vibrant, playful color variety while keeping a cohesive palette (frontend/public/assets/generated/hero-banner-1.dim_1600x600.png > hero-banner-1-colorful.dim_1600x600.png)",
      "Increase saturation/contrast and add more vibrant, playful color variety while keeping a cohesive palette (frontend/public/assets/generated/hero-banner-2.dim_1600x600.png > hero-banner-2-colorful.dim_1600x600.png)",
      "Increase saturation/contrast and add more vibrant, playful color variety while keeping a cohesive palette (frontend/public/assets/generated/hero-banner-3.dim_1600x600.png > hero-banner-3-colorful.dim_1600x600.png)",
      "Make icon colors more varied and vibrant while keeping clean flat-illustration readability (frontend/public/assets/generated/category-icons-sprite.dim_1024x1024.png > category-icons-sprite-colorful.dim_1024x1024.png)",
      "Increase color vibrancy and clarity for each badge while keeping consistent style and high contrast (frontend/public/assets/generated/trust-badges-set.dim_1024x256.png > trust-badges-set-colorful.dim_1024x256.png)"
    ]
  }
}