{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Vendor wallet limit UX, customer product filtering, and vendor outlet profile editing",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Ensure customer-facing product feeds in the UI rely on the backend’s customer product feed so disabled-outlet products are hidden from customers.",
      "acceptanceCriteria": [
        "Customer-facing product lists in the UI (home, categories, wishlist, etc.) use the backend customer product feed so products from disabled outlets are not shown.",
        "Vendor-facing product pages continue to use vendor product feeds and remain unaffected."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the customer-facing product query hook to call the backend capability that returns customer-filtered products (e.g., getCustomerProducts()) instead of the unfiltered feed, keeping vendor/admin product queries unchanged."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update vendor dashboard and wallet UI to show a wallet panel (Wallet Due, 10% commission rate, ₹1,000 limit) and show a prominent red warning banner when walletDue >= 1000 and/or outlet is disabled.",
      "acceptanceCriteria": [
        "Vendor wallet page displays Wallet Due, Commission Rate: 10%, and Limit: ₹1,000.",
        "Vendor dashboard page shows a destructive (red) warning banner when walletDue >= 1000 or outletStatus is disabled.",
        "All user-facing warning/banner text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/vendor/VendorDashboardPage.tsx",
          "operation": "modify",
          "description": "Adjust vendor dashboard wallet UI to explicitly communicate Wallet Due (not just styling) and add a destructive warning banner when walletDue >= 1000 even if outletStatus has not yet refreshed to disabled; keep all banner text in English."
        },
        {
          "path": "frontend/src/pages/vendor/VendorWalletPage.tsx",
          "operation": "modify",
          "description": "Add a destructive warning banner when walletDue >= 1000 (in addition to outletStatus disabled) and ensure the wallet panel clearly presents Wallet Due, Commission Rate = 10%, and Limit = ₹1,000 with English text."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Display an Outlet Profile section on the vendor profile page including outlet fields, outlet photo, and masked Aadhaar (GST optional).",
      "acceptanceCriteria": [
        "Backend vendor record includes fields necessary to persist Outlet Profile information (including an optional GST field).",
        "Vendor profile page displays all requested outlet profile fields when present.",
        "Aadhaar is shown masked in the vendor profile UI (e.g., only last digits visible; exact masking format is consistent)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/maskAadhaar.ts",
          "operation": "create",
          "description": "Add a small utility to consistently mask Aadhaar for display (e.g., show only last 4 digits) and ensure no UI code ever renders the full Aadhaar value."
        },
        {
          "path": "frontend/src/pages/vendor/VendorProfilePage.tsx",
          "operation": "modify",
          "description": "Extend the vendor profile UI to include an 'Outlet Profile' section showing Outlet Name, Photo (render via ExternalBlob direct URL), Mobile, City, Area, masked Aadhaar (using the new utility), and GST when present; keep all labels in English."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add an Edit Outlet flow on the vendor profile page to update outlet profile fields (including outlet photo), persist changes to the backend, and refresh vendor data immediately after saving.",
      "acceptanceCriteria": [
        "An \"Edit Outlet\" button is visible on the vendor profile page.",
        "Saving edits persists the updated outlet profile to the backend and the vendor profile UI reflects changes without a full page reload.",
        "GST can be left empty/cleared and remains optional.",
        "Aadhaar is not stored/displayed as an unmasked full number via the vendor profile UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a mutation hook for updating the outlet profile via the existing backend capability (updateOutletProfile), ensuring successful saves invalidate/refetch relevant vendor queries (at minimum: callerVendor; optionally any views that depend on outlet profile)."
        },
        {
          "path": "frontend/src/components/vendor/EditOutletDialog.tsx",
          "operation": "create",
          "description": "Create an Edit Outlet dialog/form component (using existing shadcn-ui components) for editing Outlet Name, Mobile, City, Area, optional GST, and outlet photo upload; for the photo use the blob-storage ExternalBlob type to upload/represent the new image. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/vendor/VendorProfilePage.tsx",
          "operation": "modify",
          "description": "Wire the new Edit Outlet dialog into the vendor profile page with an \"Edit Outlet\" button, prefill current values from callerVendor, allow clearing GST (send null), and ensure Aadhaar is never editable or displayed unmasked; refresh UI via react-query invalidation after save (no full page reload)."
        }
      ]
    }
  ]
}