{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Internet Identity admin login and rebuild frontend role-based access (admin/vendor/customer) with safe guards",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Make admin assignment enable /admin access immediately without reload and remove hard dependency on caffeineAdminToken for actor initialization.",
      "acceptanceCriteria": [
        "From an authenticated non-admin session, performing the “assign admin” action results in `isAdmin` becoming true after React Query refetch/invalidations and `/admin` content becomes accessible.",
        "Admin dashboard loads successfully after assignment without requiring manual URL token manipulation.",
        "If `?caffeineAdminToken=...` is absent, the app still initializes the backend actor successfully (no actor init hard-failure solely due to missing token)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Update actor initialization to never hard-fail solely due to a missing/empty `caffeineAdminToken` param (e.g., only attempt secret-based initialization when a token is present and/or wrap secret initialization in safe error handling that falls back to a usable actor). Ensure identity changes still recreate the actor and invalidate dependent React Query data. Use patterns aligned with the selected \"authorization\" component for Internet Identity + RBAC flows. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the admin-assignment mutation flow so that after assigning admin it reliably flips the UI into an admin state without a crash/reload: invalidate/refetch the canonical role query (new role model), plus `isAdmin`, and avoid unnecessary actor invalidation loops unless required. Ensure the mutation uses the backend's intended admin-claim/assignment behavior once available. Use patterns aligned with the selected \"authorization\" component for cache clearing and role refetch after auth/role changes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Adjust the admin diagnostics/CTA UI copy and logic to remove reliance on `caffeineAdminToken` as a required step for gaining admin access (keep diagnostics if helpful, but do not instruct users to add a token for normal operation). Ensure the “Assign Admin Role to My Account” action triggers the updated mutation and that the page updates automatically once role/admin queries refetch. Use patterns aligned with the selected \"authorization\" component for handling authorization failures gracefully. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Migrate frontend route guards and role-aware UI to canonical roles: admin, vendor, customer (replace requiredRole=\"user\" with requiredRole=\"customer\").",
      "acceptanceCriteria": [
        "All guarded customer routes (e.g., profile/wishlist/orders) still function for authenticated customers and do not mistakenly deny access due to role renaming.",
        "All vendor routes remain guarded by vendor access.",
        "All admin routes remain guarded by admin access."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Introduce/standardize a single canonical role query hook backed by the backend's three-role model (admin/vendor/customer), and migrate call sites away from legacy `user` role assumptions. Keep anonymous/unauthenticated behavior treated as a separate UI state (e.g., guest) without using it as a persisted role. Use patterns aligned with the selected \"authorization\" component for role querying and guarding app data behind login. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/RequireRole.tsx",
          "operation": "modify",
          "description": "Update `requiredRole` to support exactly: 'admin' | 'vendor' | 'customer'. Replace the 'user' guard logic with 'customer' semantics, using the canonical role query. Ensure admin/vendor guards remain correct and consistent with the new role names. Use patterns aligned with the selected \"authorization\" component for access control UI and role checks. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update route wrappers so customer-only pages (e.g., /profile, /wishlist, /orders) use `RequireRole requiredRole=\"customer\"` instead of `\"user\"`. Keep vendor/admin routes guarded by their respective roles. This wiring ensures new guard behavior is actually applied across navigable routes."
        },
        {
          "path": "frontend/src/components/TopNav.tsx",
          "operation": "modify",
          "description": "Update role-aware navigation logic to use the canonical three-role model (admin/vendor/customer), avoiding legacy `user` checks. Ensure customers still see customer navigation, vendors see vendor navigation, and admins see admin navigation. Use patterns aligned with the selected \"authorization\" component for hiding restricted navigation items when unauthorized. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/BottomNav.tsx",
          "operation": "modify",
          "description": "Update role-aware bottom navigation logic to use the canonical three-role model (admin/vendor/customer) and avoid treating 'not admin and not vendor' as implicitly customer unless authenticated and role is confirmed. Use patterns aligned with the selected \"authorization\" component for role-derived UI state. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Harden RequireRole to never crash on missing/undefined actor, identity, or role data by rendering loading skeletons until data is ready.",
      "acceptanceCriteria": [
        "Navigating directly to `/admin` while role queries are still pending does not crash the app.",
        "If `identity` exists but role queries return `undefined` transiently, `RequireRole` shows a loading UI rather than denying access or throwing.",
        "The same defensive behavior applies to all supported requiredRole values (admin/vendor/customer)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/RequireRole.tsx",
          "operation": "modify",
          "description": "Add/ensure defensive checks for all guard branches so undefined transient states (identity present but role/admin/vendor queries not yet available; actor state still fetching; query results temporarily undefined) render a loading skeleton rather than denying access or causing errors. Apply consistently for requiredRole admin/vendor/customer. Use patterns aligned with the selected \"authorization\" component to prevent guard crashes during actor/role initialization. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure role-related queries return stable loading/fetched semantics when dependent on actor initialization (e.g., avoid returning misleading defaults that cause premature denial; align enabled/isLoading/isFetched with actor availability). This supports RequireRole's loading-first behavior. Use patterns aligned with the selected \"authorization\" component for preventing UI flashes and handling actor dependency correctly. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}