{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize /admin dashboard with defensive rendering and deterministic admin-role gating",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make AdminDashboardPage render-safe for null/partial analytics and invalid numeric conversions, and prevent Recharts crashes via explicit empty-state rendering.",
      "acceptanceCriteria": [
        "Navigating to /admin never triggers AdminErrorBoundary for data-shape issues coming from analytics (null/undefined/partial fields).",
        "If analytics.totalRevenue (or any numeric field) converts to NaN/Infinity or otherwise invalid, the dashboard renders a safe fallback value (e.g., \"0\" / \"0.00\") and does not throw.",
        "Recharts section never throws due to invalid/empty chart data; when chart data is invalid/empty, an explicit empty-state UI is shown instead of rendering the chart."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Harden AdminDashboardPage rendering: validate analytics object/fields before use; replace direct Number/toFixed usage with finite-number guards (treat NaN/Infinity as 0); ensure revenue formatting cannot throw; sanitize chartData (finite, non-negative) and render a clear empty-state when data is empty/invalid to avoid Recharts runtime crashes."
        },
        {
          "path": "frontend/src/utils/safeNumbers.ts",
          "operation": "create",
          "description": "Add shared helpers for defensive numeric handling (e.g., bigint->number conversion that clamps non-finite results to 0, safeFixed that never throws, and safe string fallback for missing values) to keep admin analytics UI resilient."
        },
        {
          "path": "frontend/src/utils/formatInr.ts",
          "operation": "modify",
          "description": "Make formatInr resilient to NaN/Infinity by coercing non-finite inputs to 0 before calling toLocaleString, preventing incidental crashes if reused by admin/vendor/customer currency displays."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure /admin content only renders after admin-role resolution completes, showing a safe loading UI while role is unresolved and access denied UI for non-admins.",
      "acceptanceCriteria": [
        "While the admin role check is still loading/unfetched, the admin route shows a non-crashing loading state (skeleton/spinner) rather than attempting to render the dashboard.",
        "If the admin role check resolves to non-admin, the user is shown the existing access denied UI and the dashboard does not render.",
        "If the admin role check resolves to admin, the dashboard renders normally and proceeds to fetch/render analytics with safe loading/empty/error states."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/RequireRole.tsx",
          "operation": "modify",
          "description": "Tighten deterministic admin guard behavior so children (AdminDashboardPage) cannot mount until the admin-role check has conclusively fetched; keep a stable skeleton/loading UI during actor/admin resolution and ensure non-admins always see the existing AccessDeniedScreen. Use the selected \"authorization\" component’s frontend role/permission model conceptually for admin gating logic. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Align role/admin React Query hooks with deterministic guard needs (e.g., ensure admin-role resolution has clear fetched/loading signals and does not transiently report false/undefined in a way that could allow premature dashboard rendering). Use the selected \"authorization\" component’s frontend role resolution expectations. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}