{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rename branding to QuickBazar and update logo/PWA icons",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Rename all visible “ShopHub” branding to “QuickBazar” across UI and app metadata (HTML + PWA manifest + Apple web app title), ensuring no remaining user-facing ShopHub/Marketplace naming.",
      "acceptanceCriteria": [
        "Top navigation brand text shows “QuickBazar” instead of “ShopHub”.",
        "frontend/index.html <title> and apple-mobile-web-app-title use “QuickBazar”.",
        "frontend/public/manifest.webmanifest uses “QuickBazar” for name/short_name (and does not mention “ShopHub” or “Marketplace”).",
        "A case-insensitive search in the frontend codebase shows no remaining user-facing “ShopHub” branding."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TopNav.tsx",
          "operation": "modify",
          "description": "Update the top navigation brand text from “ShopHub” to “QuickBazar” (consistent casing, no space), and align any related accessibility labels/alt text that are part of the brand presentation."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Set the document <title> to “QuickBazar” and update the apple-mobile-web-app-title meta tag to “QuickBazar” to match the new branding."
        },
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "modify",
          "description": "Update PWA manifest name/short_name to “QuickBazar” and ensure no occurrence of “ShopHub” or “Marketplace” remains in manifest user-visible fields (including description if needed). Keep existing icon src paths unchanged."
        },
        {
          "path": "frontend/public/offline.html",
          "operation": "modify",
          "description": "Update offline page metadata/title to reflect “QuickBazar” (e.g., document title), ensuring the offline experience does not display legacy “Marketplace” branding."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Replace user-facing “ShopHub” mentions with “QuickBazar” in About page headings/body copy."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Replace user-facing “shophub” branding in contact details (e.g., support email text/link) with “QuickBazar”-appropriate branding so users do not see “ShopHub”."
        },
        {
          "path": "frontend/public/sw.js",
          "operation": "modify",
          "description": "Update service worker cache naming/versioning to reflect “QuickBazar” branding (to avoid keeping old branded cache names) while preserving existing offline and precache behavior."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Replace the existing header logo reference with a newly generated QuickBazar logo stored under frontend/public/assets/generated and render it crisply without layout shift.",
      "acceptanceCriteria": [
        "TopNav no longer references /assets/Colorful Illustrative Online Shop Logo.jpg.jpeg.",
        "TopNav renders the newly generated logo image from /assets/generated/ and the image alt text is updated to “QuickBazar logo”.",
        "Logo renders crisply on mobile and desktop without layout shift (no stretched or pixelated appearance)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/quickbazar-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the newly generated QuickBazar logo asset at frontend/public/assets/generated/quickbazar-logo.dim_512x512.png (transparent background), matching the provided image requirement."
        },
        {
          "path": "frontend/src/components/TopNav.tsx",
          "operation": "modify",
          "description": "Remove the legacy header logo reference (/assets/Colorful Illustrative Online Shop Logo.jpg.jpeg) and render the new generated logo from frontend/public/assets/generated/quickbazar-logo.dim_512x512.png. Update alt text to “QuickBazar logo”, and adjust sizing/rendering (e.g., explicit dimensions and appropriate object-fit) to ensure crisp display and prevent layout shift."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Regenerate and replace existing PWA icon assets with QuickBazar-branded icons, keeping the same filenames/paths referenced by the manifest.",
      "acceptanceCriteria": [
        "The following existing files are replaced with newly generated QuickBazar-branded icons while keeping the same filenames and dimensions: pwa-icon.dim_192x192.png, pwa-icon.dim_512x512.png, pwa-maskable.dim_512x512.png, apple-touch-icon.dim_180x180.png.",
        "frontend/public/manifest.webmanifest continues to reference the same icon paths under /assets/generated/ and installs successfully as a PWA.",
        "On iOS/Android “Add to Home Screen”, the installed icon shows the updated QuickBazar design (not the old icon)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/pwa-icon.dim_192x192.png",
          "operation": "modify",
          "description": "Replace the existing 192x192 PWA icon file contents with the newly generated QuickBazar-branded design, keeping the exact same filename and path."
        },
        {
          "path": "frontend/public/assets/generated/pwa-icon.dim_512x512.png",
          "operation": "modify",
          "description": "Replace the existing 512x512 PWA icon file contents with the newly generated QuickBazar-branded design, keeping the exact same filename and path."
        },
        {
          "path": "frontend/public/assets/generated/pwa-maskable.dim_512x512.png",
          "operation": "modify",
          "description": "Replace the existing 512x512 maskable icon file contents with the newly generated QuickBazar-branded design (with safe padding), keeping the exact same filename and path."
        },
        {
          "path": "frontend/public/assets/generated/apple-touch-icon.dim_180x180.png",
          "operation": "modify",
          "description": "Replace the existing 180x180 Apple touch icon file contents with the newly generated QuickBazar-branded design, keeping the exact same filename and path."
        }
      ]
    }
  ]
}